[
    {
        "id": "PERFORMANCE_CRITICISM",
        "text": "Takım lideriniz birebir görüşme için sizi odasına çağırdı. Görüşme sırasında potansiyelinizin altında performans gösterdiğinizi ve elinizden geleni yapmadığınızı düşündüğünü söyledi. Bu geri bildirime nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -5,
            "performance": 10,
            "colleagues": 0,
            "boss": 15
        },
        "noEffects": {
            "motivation": -10,
            "performance": -5,
            "colleagues": 0,
            "boss": -10
        },
        "yesText": "Eleştiriyi kabul edip iyileşme sözü vereceğim",
        "noText": "Performansımın yeterli olduğunu düşünüyorum",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "IMPROVEMENT_PLAN",
                "text": "Üç gün önce takım liderinizin eleştirisini kabul etmiş ve gelişme sözü vermiştiniz. Bu yaklaşımınız olumlu karşılandı. Birlikte somut bir iyileştirme planı oluşturdunuz ve lideriniz gelişiminizi destekleyeceğini belirtti.",
                "effects": {
                    "motivation": 15,
                    "performance": 15,
                    "colleagues": 5,
                    "boss": 20
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 60
            },
            {
                "id": "INCREASED_SCRUTINY",
                "text": "Beş gün önce takım liderinizin performans eleştirisini kabul etmiştiniz. Yaklaşımınız olumlu karşılansa da, artık performansınız daha yakından takip ediliyor. Bu durum üzerinizde ek bir baskı oluşturuyor ve iş stresini artırıyor.",
                "effects": {
                    "motivation": -10,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 30
            },
            {
                "id": "RENEWED_MOTIVATION",
                "text": "Bir hafta önce takım liderinizin performans eleştirisini kabul etmiş ve iyileşme sözü vermiştiniz. Bu açık konuşma sizi motive etti. Eleştirileri yapıcı bir şekilde kabul etmeniz kendinizi kanıtlama arzusu yarattı ve performansınızda gözle görülür bir iyileşme sağladınız.",
                "effects": {
                    "motivation": 20,
                    "performance": 20,
                    "colleagues": 10,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 10
            }
        ],
        "noFollowups": [
            {
                "id": "EVIDENCE_DISCUSSION",
                "text": "Performansınızın yeterli olduğunu ifade etmeniz üzerine, takım lideriniz somut örnekler ve verilerle görüşünü destekledi. Bu karşılıklı değerlendirme, bakış açınızda bazı kör noktaları fark etmenizi sağladı.",
                "effects": {
                    "motivation": -5,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            },
            {
                "id": "EXPECTATION_MISMATCH",
                "text": "Beş gün önce takım liderinize performansınızın yeterli olduğunu düşündüğünüzü söylemiştiniz. O görüşmeden sonra, liderin sizden beklentileri ile kendi değerlendirmeniz arasında önemli bir uyumsuzluk olduğunu fark ettiniz. Bu durum, gelecekteki performans değerlendirmelerinizde sorun yaratabilir.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 35
            },
            {
                "id": "CONSTRUCTIVE_DIALOGUE",
                "text": "İki gün önce takım liderinize performansınızın yeterli olduğunu düşündüğünüzü söylemiştiniz. Görüşünüzü profesyonelce ifade etmeniz, performans beklentileri hakkında yapıcı bir diyalog başlattı. Takım lideriniz bakış açınızı dinledi ve bazı noktalarda size hak verdi. Bu karşılıklı anlayış, iş ilişkinizi olumlu yönde etkiledi.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 15
            }
        ]
    },
    {
        "id": "COMPANY_FAIR_REPRESENTATIVE",
        "text": "Şirket ürünlerinin tanıtımı için düzenlenecek önemli bir sektör fuarına katılım planlanıyor. Şirket temsilcisi olarak ilk olarak size teklif yapıldı. Fuara katılmak seyahat gerektiriyor ve birkaç günlük yoğun bir program anlamına geliyor. Teklifi kabul edecek misiniz?",
        "yesEffects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 5,
            "boss": 15
        },
        "noEffects": {
            "motivation": -5,
            "performance": 10,
            "colleagues": -5,
            "boss": -10
        },
        "yesText": "Teklifi kabul edeceğim",
        "noText": "Teklifi nazikçe reddedeceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "SUCCESSFUL_REPRESENTATION",
                "text": "Bir ay önce katıldığınız sektör fuarında şirketi başarıyla temsil ettiniz. Ürün sunumlarınız büyük ilgi gördü ve birçok potansiyel müşteriyle değerli bağlantılar kurdunuz. Yönetim ekibi, profesyonel yaklaşımınız ve şirketi etkileyici şekilde tanıtmanızdan dolayı sizi tebrik etti.",
                "effects": {
                    "motivation": 20,
                    "performance": 15,
                    "colleagues": 15,
                    "boss": 25
                },
                "isInfoOnly": true,
                "delay": 30,
                "probability": 55
            },
            {
                "id": "INDUSTRY_CONNECTIONS",
                "text": "Fuarda şirketi temsil ederken sektördeki önemli isimlerle tanışma fırsatı buldunuz. Bu yeni bağlantılar sayesinde hem şirketiniz için yeni iş fırsatları doğdu hem de kişisel profesyonel ağınızı genişlettiniz. Artık sektörde daha görünür bir konumdasınız.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 10,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 45,
                "probability": 30
            },
            {
                "id": "EXHAUSTING_EXPERIENCE",
                "text": "Fuardaki yoğun program ve sürekli etkileşim sizi oldukça yordu. Dönüşünüzde birkaç gün dinlenmeniz gerekti ve normal iş temponuza dönmekte zorlandınız. Ancak, edindiğiniz deneyim ve kurduğunuz bağlantılar uzun vadede faydalı olacak.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 14,
                "probability": 15
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_OPPORTUNITY",
                "text": "Fuarı reddetme kararınızdan sonra, yerinize giden ekip üyesi önemli müşteri bağlantıları kurdu ve şirket içinde görünürlüğünü artırdı. Üst yönetim, bu kişinin gösterdiği inisiyatifi takdir etti ve yeni sorumluluklar verdi. Bu fırsatı kaçırdığınız için hafif bir pişmanlık hissediyorsunuz.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -10,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 30,
                "probability": 60
            },
            {
                "id": "PRODUCTIVITY_FOCUS",
                "text": "Fuara katılmamayı seçerek mevcut projelerinize odaklanmaya devam ettiniz. Bu süreçte önemli bir görevi zamanından önce tamamladınız. Yöneticiniz, işe olan bağlılığınızı ve verimliliğinizi takdir etti.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 21,
                "probability": 30
            },
            {
                "id": "FUTURE_CONSIDERATION",
                "text": "Bu fuar teklifini reddetmenize rağmen, yöneticiniz gelecekteki etkinliklerde sizi değerlendirmeye devam edeceğini belirtti. Önümüzdeki çeyrekte daha uygun bir zamanda gerçekleşecek bir etkinlik için sizinle tekrar görüşeceklerini söyledi.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 14,
                "probability": 10
            }
        ]
    },
    {
        "id": "CROSS_DEPARTMENT_PROJECT",
        "text": "Farklı departmanlardan uzmanların bir araya geldiği prestijli bir projede yer almanız istendi. Bu, normal sorumluluklarınıza ek iş yükü getirecek ancak şirket genelinde görünürlüğünüzü artıracak. Ne yapacaksınız?",
        "yesEffects": {
            "motivation": 15,
            "performance": 5,
            "colleagues": 10,
            "boss": 15
        },
        "noEffects": {
            "motivation": -5,
            "performance": 10,
            "colleagues": -5,
            "boss": -10
        },
        "yesText": "Projede yer alacağım",
        "noText": "Mevcut işlerime odaklanacağım",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "EXPANDED_NETWORK",
                "text": "Projede yer almanız sayesinde şirket genelinde değerli bağlantılar kurdunuz ve farklı departmanların işleyişi hakkında bilgi edindiniz. Bu deneyim, kariyer gelişiminizde yeni kapılar açtı.",
                "effects": {
                    "motivation": 20,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 45,
                "probability": 60
            },
            {
                "id": "INNOVATIVE_SOLUTION",
                "text": "Farklı uzmanlık alanlarının bir araya geldiği projede, kendi bilgi ve deneyiminizle benzersiz çözümler geliştirdiniz. Bu katkınız üst yönetimin dikkatini çekti ve başarınız şirket genelinde duyuruldu.",
                "effects": {
                    "motivation": 25,
                    "performance": 15,
                    "colleagues": 20,
                    "boss": 25
                },
                "isInfoOnly": true,
                "delay": 30,
                "probability": 40
            }
        ],
        "noFollowups": [
            {
                "id": "CORE_EXCELLENCE",
                "text": "Mevcut işlerinize odaklanma kararınız, kendi alanınızda mükemmellik göstermenizi sağladı. Bölümünüzdeki performansınız ve veriminiz önemli ölçüde arttı, bu da yöneticiniz tarafından takdir edildi.",
                "effects": {
                    "motivation": 10,
                    "performance": 20,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 21,
                "probability": 70
            },
            {
                "id": "FUTURE_INVITATION",
                "text": "Şu anki iş yükünüzü gerekçe göstererek reddettiğiniz proje başarıyla tamamlandı. Gösterdiğiniz profesyonellikten dolayı, gelecekteki daha büyük ve prestijli bir projede yer almanız için yeniden davet edildiniz.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 60,
                "probability": 30
            }
        ]
    },
    {
        "id": "PROFESSIONAL_DEVELOPMENT",
        "text": "Şirket dışında, alanınızda prestijli bir sertifika programına katılma fırsatınız var. Program mesai saatleri dışında olacak ve kişisel zamanınızı alacak, ancak kariyerinize büyük katkı sağlayabilir. Katılmak ister misiniz?",
        "yesEffects": {
            "motivation": 15,
            "performance": 5,
            "colleagues": 0,
            "boss": 10
        },
        "noEffects": {
            "motivation": 0,
            "performance": 0,
            "colleagues": 0,
            "boss": 0
        },
        "yesText": "Sertifika programına katılacağım",
        "noText": "Şimdilik erteleyeceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "CAREER_BOOST",
                "text": "Sertifika programını başarıyla tamamladınız ve bu yeni uzmanlığınız hem şirket içinde hem de sektörde tanındı. Yöneticiniz, yeni becerilerinizi kullanabileceğiniz daha zorlu ve ödüllendirici projelere dahil edilmenizi önerdi.",
                "effects": {
                    "motivation": 25,
                    "performance": 15,
                    "colleagues": 10,
                    "boss": 20
                },
                "isInfoOnly": true,
                "delay": 20,
                "probability": 70
            },
            {
                "id": "KNOWLEDGE_SHARING",
                "text": "Geçen ay sertifika programında edindiğiniz bilgileri ekibinizle paylaşarak kısa bir eğitim düzenlediniz. Bu girişiminiz, ekibin gelişimine katkı sağladı ve liderlik vasıflarınızı gösterdi.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 20,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 35,
                "probability": 30
            }
        ],
        "noFollowups": [
            {
                "id": "BALANCED_LIFE",
                "text": "Sertifika programını erteleme kararınız, iş-yaşam dengenizi korumanızı sağladı. Bu süreçte ailenize ve kişisel ilgi alanlarınıza daha fazla zaman ayırdınız, bu da genel mutluluğunuzu ve iş motivasyonunuzu artırdı.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 30,
                "probability": 25
            },
            {
                "id": "IMPROVED_PROGRAM",
                "text": "Geçtiğimiz ay karşınıza çıkan bir sertifika programına daha sonra katılırım düşüncesiyle katılmamayı tercih etmiştiniz. Ertelediğiniz programın daha kapsamlı ve şirket tarafından desteklenen bir versiyonu duyuruldu. Şimdi hem mesai saatlerinde katılabileceksiniz hem de masraflarınız karşılanacak.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 30,
                "probability": 35
            }
        ]
    },
    {
        "id": "MENTORING_OPPORTUNITY",
        "text": "Ekibe yeni katılan genç bir çalışana mentor olmanız istendi. Bu, normal iş yükünüze ek bir sorumluluk getirecek ancak mesleki gelişiminize de katkı sağlayabilir. Teklifi kabul edecek misiniz?",
        "yesEffects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 15,
            "boss": 15
        },
        "noEffects": {
            "motivation": 0,
            "performance": 10,
            "colleagues": -5,
            "boss": -5
        },
        "yesText": "Mentorluğu kabul edeceğim",
        "noText": "Şu an için teşekkür edip reddedeceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "LEADERSHIP_GROWTH",
                "text": "Yeni çalışana mentorluk yaparken, kendi liderlik becerilerinizi de geliştirdiniz. Bu deneyim size yeni perspektifler kazandırdı ve kariyerinizde ilerlemek için gereken becerileri pekiştirdi.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 10,
                    "boss": 20
                },
                "isInfoOnly": true,
                "delay": 30,
                "probability": 65
            },
            {
                "id": "MUTUAL_LEARNING",
                "text": "Yeni çalışana mentorluk yaparken, mentorluk ilişkisi beklenmedik şekilde iki yönlü bir öğrenme deneyimine dönüştü. Yeni çalışan taze perspektifiyle size de yeni teknolojiler ve yaklaşımlar konusunda ilham verdi.",
                "effects": {
                    "motivation": 20,
                    "performance": 15,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 14,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "FOCUSED_ACHIEVEMENTS",
                "text": "Yeni çalışana mentorluk yapmayı reddetme kararınız, kendi işlerinize odaklanmanızı sağladı. Bu sayede önemli bir projeyi zamanından önce tamamladınız ve takdir topladınız.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 21,
                "probability": 5
            },
            {
                "id": "FUTURE_OPPORTUNITY",
                "text": "Şu anki iş yoğunluğunuz azaldığında, yöneticiniz mentorluk teklifi için yeniden size başvurdu. Bu kez daha uygun koşullarda ve özel zaman ayrılarak programın düzenlenmesi önerildi.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 45,
                "probability": 20
            }
        ]
    },
    {
        "id": "RECOGNITION_FOR_WORK",
        "text": "Üzerinde uzun süredir çalıştığınız bir projede gösterdiğiniz çaba ve yenilikçi çözümleriniz yönetim tarafından fark edildi. Yöneticiniz size özel bir takdir toplantısı düzenledi. Nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": 15,
            "performance": 10,
            "colleagues": 5,
            "boss": 15
        },
        "noEffects": {
            "motivation": 5,
            "performance": 5,
            "colleagues": 15,
            "boss": 0
        },
        "yesText": "Başarıyı sahiplenip teşekkür edeceğim",
        "noText": "Alçakgönüllü kalıp ekip çalışmasını vurgulayacağım",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "CAREER_ADVANCEMENT",
                "text": "İki hafta önce, başarınızı sahiplenip teşekkür etmeyi seçmiştiniz. Bu yaklaşımınız yönetim kademesinde olumlu bir izlenim bıraktı ve şirkette daha üst düzey bir pozisyon için düşünüldüğünüzü öğrendiniz.",
                "effects": {
                    "motivation": 20,
                    "performance": 15,
                    "colleagues": 5,
                    "boss": 20
                },
                "isInfoOnly": true,
                "delay": 14,
                "probability": 60
            },
            {
                "id": "MENTORSHIP_OPPORTUNITY",
                "text": "Bir hafta önce, başarınızı sahiplenip teşekkür etmeyi seçmiştiniz. Gösterdiğiniz profesyonellik ve uzmanlık, üst düzey bir yöneticinin dikkatini çekti. Size mentorluk teklif etti ve kariyer gelişiminize katkıda bulunmak istediğini belirtti.",
                "effects": {
                    "motivation": 15,
                    "performance": 15,
                    "colleagues": 10,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 40
            }
        ],
        "noFollowups": [
            {
                "id": "TEAM_ADMIRATION",
                "text": "Beş gün önce, alçakgönüllü kalıp ekip çalışmasını vurgulamayı seçmiştiniz. Bu yaklaşımınız takım arkadaşlarınız arasında büyük takdir topladı. Ekip içindeki dayanışma güçlendi ve herkes sizinle çalışmaktan keyif aldığını ifade etti.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 25,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 70
            },
            {
                "id": "LEADERSHIP_QUALITIES",
                "text": "Üç hafta önce, alçakgönüllü kalıp ekip çalışmasını vurgulamayı seçmiştiniz. Bu alçakgönüllü tavrınız ve ekip çalışmasını vurgulamanız, yöneticiniz tarafından güçlü bir liderlik özelliği olarak değerlendirildi. Gelecekte bir ekip liderliği pozisyonu için sizi düşünmeye başladı.",
                "effects": {
                    "motivation": 10,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 20
                },
                "isInfoOnly": true,
                "delay": 21,
                "probability": 30
            }
        ]
    },
    {
        "id": "TASK_RESPONSIBILITY_DISPUTE",
        "text": "Bir iş arkadaşınız, aslen kendi sorumluluğunda olduğunu düşündüğünüz bir görevi size yaptırmaya çalışıyor. Halihazırda kendi iş yükünüz fazla ve bu ek görev zaman planınızı bozacak. Nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -15,
            "performance": -10,
            "colleagues": 10,
            "boss": 5
        },
        "noEffects": {
            "motivation": 5,
            "performance": 5,
            "colleagues": -10,
            "boss": 0
        },
        "yesText": "Şimdilik kabul edip görevi yapacağım",
        "noText": "Bu görevin bana ait olmadığını açıklayacağım",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "REPEATED_PATTERN",
                "text": "Geçen ay, size ait olmayan görevi kabul etmiştiniz. Bu durum bir emsal oluşturdu ve aynı iş arkadaşınız benzer görevleri sürekli size yönlendirmeye başladı. İş yükünüz giderek artıyor ve asıl sorumluluklarınız için yeterli zaman bulamıyorsunuz.",
                "effects": {
                    "motivation": -20,
                    "performance": -15,
                    "colleagues": 0,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 30,
                "probability": 60
            },
            {
                "id": "TEAM_PLAYER_RECOGNITION",
                "text": "İki hafta önce, size ait olmayan görevi üstlenmiştiniz. Bu yardımseverliğiniz takım tarafından fark edildi ve 'ekip oyuncusu' olarak tanınmaya başladınız. Yöneticiniz ekip çalışmasına verdiğiniz önem için sizi takdir etti.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 14,
                "probability": 30
            },
            {
                "id": "BURNOUT_SYMPTOMS",
                "text": "Size ait olmayan görevi kabul etmenizin üzerinden birkaç hafta geçti. Bu, diğer sorumluluklarınızla birleşince aşırı iş yüküne neden oldu. Kendinizi sürekli yorgun ve tükenmiş hissediyorsunuz, bu da genel performansınızı etkilemeye başladı.",
                "effects": {
                    "motivation": -15,
                    "performance": -20,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 21,
                "probability": 10
            }
        ],
        "noFollowups": [
            {
                "id": "BOUNDARY_RESPECTED",
                "text": "Üç hafta önce, size ait olmayan görevi nazikçe reddetmiştiniz. İş arkadaşınız başta biraz rahatsız olsa da, açıklamanızı anladı ve görevi üstlendi. Bu olaydan sonra iş sınırlarınıza daha fazla saygı göstermeye başladı.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 21,
                "probability": 45
            },
            {
                "id": "ESCALATED_CONFLICT",
                "text": "Size ait olmayan görevi reddettiğinizde, iş arkadaşınız bunu kişisel olarak aldı ve durumu yöneticinize taşıdı. Sonuçta görev dağılımını netleştirmek için bir toplantı yapıldı ve sizin haklı olduğunuz ortaya çıktı, ancak bu süreç gereksiz bir gerginlik yarattı.",
                "effects": {
                    "motivation": -5,
                    "performance": -10,
                    "colleagues": -15,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 35
            },
            {
                "id": "CLARIFIED_RESPONSIBILITIES",
                "text": "Bir ay önce, size ait olmayan görevi reddetmeniz sonrasında, yöneticiniz ekipteki görev dağılımını netleştiren bir toplantı düzenledi. Bu, herkesin sorumluluklarını daha iyi anlamasını sağladı ve benzer karışıklıkların önüne geçti.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 10,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 30,
                "probability": 20
            }
        ]
    },
    {
        "id": "UNAUTHORIZED_PHOTO_SHARING",
        "text": "Şirketin iç iletişim portalında izniniz olmadan çekilmiş ve paylaşılmış fotoğraflarınızı gördünüz. Fotoğraflar son yapılan bir etkinlikte çekilmiş ama sizden hiç onay alınmamış. Nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": -5,
            "boss": 0
        },
        "noEffects": {
            "motivation": -10,
            "performance": -5,
            "colleagues": 5,
            "boss": 5
        },
        "yesText": "Fotoğrafların kaldırılmasını resmi olarak talep edeceğim",
        "noText": "Durumu görmezden geleceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "PROMPT_RESOLUTION",
                "text": "Geçen hafta izniniz olmadan paylaşılan fotoğraflar konusunda resmi bir talepte bulunmuştunuz. İletişim departmanı hızlı bir şekilde özür diledi ve fotoğrafları kaldırdı. Ayrıca gelecekte fotoğraf paylaşımı konusunda daha dikkatli olacaklarını belirttiler.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 55
            },
            {
                "id": "PRIVACY_POLICY_UPDATE",
                "text": "İki hafta önce izinsiz fotoğraf paylaşımı konusunda yaptığınız resmi başvuru, şirket genelinde bir politika değişikliğine yol açtı. Artık tüm fotoğraf paylaşımları için çalışanlardan açık izin alınması gerekiyor. Birçok çalışan tarafından mahremiyete saygı gösterilmesini sağladığınız için takdir edildiniz.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 10,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 14,
                "probability": 25
            },
            {
                "id": "OVERREACTION_PERCEPTION",
                "text": "Bir ay önce izinsiz fotoğraf paylaşımı konusunda resmi talepte bulunmuştunuz. Bazı çalışanlar bu tepkinizi aşırı buldu ve arkanızdan 'hassas' veya 'duyarlı' olarak bahsetmeye başladılar. Haklı olduğunuzu düşünseniz de, bu algı sizi biraz rahatsız ediyor.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -15,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 30,
                "probability": 20
            }
        ],
        "noFollowups": [
            {
                "id": "MORE_PHOTOS_APPEAR",
                "text": "İzinsiz paylaşılan fotoğrafları görmezden gelmenizden sonra, benzer durum tekrar yaşandı ve farklı etkinliklerden daha fazla fotoğrafınız paylaşıldı. Artık durumu görmezden gelmek daha zor ve kendinizi rahatsız hissediyorsunuz.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 20,
                "probability": 65
            },
            {
                "id": "POSITIVE_FEEDBACK",
                "text": "İzinsiz paylaşılan fotoğraflarınızı görmezden gelmeyi seçmiştiniz. Beklenmedik şekilde, bu fotoğraflar sayesinde birkaç çalışma arkadaşınızdan olumlu yorumlar aldınız ve bazı departmanlardan insanlarla tanışma fırsatı buldunuz.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 35
            }
        ]
    },
    {
        "id": "NEW_TEAMMATE_CRITICISM",
        "text": "Ekibe yeni katılan bir takım arkadaşınız, sizi çok tanımadan, sadece gözlemlerine dayanarak bazı kişilik özelliklerinizi eleştirdi. Bu beklenmedik yorum karşısında nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -10,
            "performance": -5,
            "colleagues": -5,
            "boss": 0
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": 10,
            "boss": 5
        },
        "yesText": "Sert bir şekilde karşılık vereceğim",
        "noText": "Sakin kalıp görüşünü anlamaya çalışacağım",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "WORSENED_REPUTATION",
                "text": "Beş gün önce, yeni ekip arkadaşınızın eleştirisine sert bir şekilde karşılık vermeyi seçmiştiniz. Bu tepkiniz, onun söylediği şeyi kanıtlar nitelikte algılandı ve ekip içinde 'zor bir kişi' olarak etiketlenmenize yol açtı. Yeni takım üyeleriyle ilişki kurmanız zorlaştı.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -20,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 70
            },
            {
                "id": "INTIMIDATED_COLLEAGUE",
                "text": "İki gün önce, yeni ekip arkadaşınızın eleştirisine sert bir şekilde karşılık vermeyi seçmiştiniz. Bu sert tepkiniz onu korkuttu. Artık sizinle iletişim kurmaktan çekiniyor ve bu durum iş birliğinizi olumsuz etkiliyor. Diğer takım üyeleri de sizin tavırlarınız konusunda tedirgin olmaya başladı.",
                "effects": {
                    "motivation": -5,
                    "performance": -15,
                    "colleagues": -10,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 30
            }
        ],
        "noFollowups": [
            {
                "id": "CONSTRUCTIVE_DIALOGUE",
                "text": "İki hafta önce, yeni ekip arkadaşınızın kişilik özelliklerinize ilişkin yorumuna sakin kalıp onu anlamaya çalışarak yaklaşmıştınız. Bu yaklaşımınız sayesinde, onun aslında iş tarzınızı yanlış yorumladığını ve sizin bazı davranışlarınızı farklı algıladığını öğrendiniz. Açık iletişim kurarak bu yanlış anlaşılmayı giderdiniz ve şimdi daha iyi bir iş ilişkiniz var.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 14,
                "probability": 60
            },
            {
                "id": "SELF_IMPROVEMENT",
                "text": "Bir ay önce yeni ekip arkadaşınızın yorumuna sakin yaklaştığınızda, onun perspektifinde haklılık payı olabileceğini fark ettiniz. Bu farkındalık, iletişim tarzınızı gözden geçirmenize ve duygusal zekânızı geliştirmenize yol açtı. Takım içindeki etkileşimlerinizde daha empatik davranmaya başladınız ve bu değişim olumlu karşılandı.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 20,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 30,
                "probability": 30
            },
            {
                "id": "RESPECTED_MATURITY",
                "text": "On gün önce, yeni ekip arkadaşınızın eleştirisine sakin kalıp anlamaya çalışmayı seçmiştiniz. Bu olgun tepkiniz, ekip içinde takdir topladı. İlerleyen günlerde bazı meslektaşlarınız bu durumu duyduklarını ve profesyonelliğinize hayran kaldıklarını belirttiler. Bu olay, ekip içindeki saygınlığınızı artırdı.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 10,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 10
            }
        ]
    },
    {
        "id": "GOSSIP_BETWEEN_FRIENDS",
        "text": "Ofiste iki yakın arkadaşınız var ve onlar da kendi aralarında yakın arkadaş. Bir gün bu arkadaşlarınızdan biri, diğeri hakkında yanınızda dedikodu yapmaya ve onu eleştirmeye başladı. Nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": -10,
            "boss": 0
        },
        "noEffects": {
            "motivation": 5,
            "performance": 0,
            "colleagues": 5,
            "boss": 5
        },
        "yesText": "Dedikodulara katılacağım",
        "noText": "Dedikodu yapmak istemediğimi söyleyeceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "DAMAGED_TRUST",
                "text": "Geçen hafta bir arkadaşınızın diğeri hakkında yaptığı dedikodulara katılmıştınız. Ne yazık ki, dedikodusunu yaptığınız arkadaşınız bunu öğrendi. Her iki arkadaşınızla da ilişkiniz bozuldu ve size olan güvenleri sarsıldı. Ofiste üçünüz arasında gergin bir atmosfer oluştu.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -20,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 60
            },
            {
                "id": "GOSSIP_CIRCLE",
                "text": "On gün önce, bir arkadaşınızın dedikodusuna katılmayı seçmiştiniz. Bu davranışınızdan sonra, arkadaşınız diğer çalışanlarla da benzer konuşmalara girdiğinizi düşünmeye başladı. Zamanla bu davranış ofiste daha geniş bir dedikodu kültürünün parçası olmanıza yol açtı ve profesyonel itibarınız zarar görmeye başladı.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -15,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 30
            },
            {
                "id": "FRIENDSHIP_ALLIANCE",
                "text": "Üç gün önce, bir arkadaşınızın dedikodusuna katılmayı seçmiştiniz. Bu durum, dedikodu yapan arkadaşınızla aranızdaki bağı güçlendirdi ancak diğer arkadaşınızla olan ilişkinizde bir soğukluk hissediyorsunuz, sanki bir şeylerden şüpheleniyormuş gibi davranıyor.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 10
            }
        ],
        "noFollowups": [
            {
                "id": "RESPECTED_STANCE",
                "text": "İki hafta önce bir arkadaşınız diğeri hakkında dedikodu yapmaya başladığında, nazikçe böyle konuşmalara katılmak istemediğinizi söylemiştiniz. Bu tavrınız sonrası her iki arkadaşınız da size daha fazla saygı duymaya başladı. Hatta dedikodu yapan arkadaşınız davranışını sorguladı ve diğer arkadaşınızla olan ilişkisini düzeltmeye çalıştı.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 14,
                "probability": 50
            },
            {
                "id": "MEDIATOR_ROLE",
                "text": "Bir hafta önce, dedikodu yapmak istemediğinizi belirtmiştiniz. Bu tavrınız ve arkadaşınıza sorunları doğrudan konuşmasını önermeniz sonucu, siz iki arkadaşınız arasında bir arabulucu rolü üstlendiniz. Yardımınızla iletişim kurdular ve aralarındaki sorunu çözmeye başladılar.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 20,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 30
            },
            {
                "id": "TEMPORARY_FRICTION",
                "text": "Dört gün önce, dedikodu yapmak istemediğinizi söylemiştiniz. Bu durum arkadaşınızın bozulmasına ve size karşı kısa süreli bir soğukluk yaşamasına neden oldu. Ancak zamanla tavrınızın doğruluğunu anladı ve size olan saygısı arttı.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 20
            }
        ]
    },
    {
        "id": "ONE_ON_ONE_DISAGREEMENT",
        "text": "Bir iş arkadaşınızla birebir konuşma sırasında önerdiğiniz fikri kabul etmedi ve aniden sesini yükselterek sinirli bir şekilde konuşmaya başladı. Nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -10,
            "performance": -10,
            "colleagues": -15,
            "boss": -5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": 10,
            "boss": 10
        },
        "yesText": "Ben de sesimi yükselteceğim",
        "noText": "Sakin kalıp durumu yatıştıracağım",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "WORSENED_RELATIONSHIP",
                "text": "Geçen hafta iş arkadaşınızla yaşadığınız birebir tartışmada siz de sesinizi yükseltmiştiniz. Bu durum kontrolden çıktı ve yakındaki çalışanlar durumu fark etti. İkiniz de birbirinize sert sözler söylediniz ve bu olaydan sonra iş ilişkiniz ciddi şekilde zarar gördü.",
                "effects": {
                    "motivation": -15,
                    "performance": -15,
                    "colleagues": -20,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 70
            },
            {
                "id": "MUTUAL_COOLING_DOWN",
                "text": "İş arkadaşınızla yaşadığınız gergin konuşmada siz de sesini yükselttiğinizde, ikiniz de durumun ciddileştiğini fark ettiniz. Kısa bir sessizlikten sonra birbirinize karşı daha anlayışlı davranmaya başladınız ve tartışma normal bir konuşmaya döndü.",
                "effects": {
                    "motivation": 0,
                    "performance": 0,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            }
        ],
        "noFollowups": [
            {
                "id": "DEESCALATION_SUCCESS",
                "text": "Üç gün önce iş arkadaşınız birebir görüşme sırasında sesini yükselttiğinde, siz sakin kalmayı başarmıştınız. Sakin tepkiniz ve durumu yatıştırma çabalarınız karşısında arkadaşınız kısa sürede kendini toparladı ve davranışı için özür diledi. Bu olaydan sonra ikiniz arasındaki karşılıklı saygı arttı.",
                "effects": {
                    "motivation": 10,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 65
            },
            {
                "id": "SUPERVISOR_INFORMED",
                "text": "İş arkadaşınız siz sakin kalmanıza rağmen saldırgan tavrını sürdürdü. Bir süre sonra yöneticiniz bu durumu fark etti ve ikinizle ayrı ayrı görüştü. Profesyonel tutumunuz takdir edildi ve arkadaşınız uyarı aldı.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 25
            },
            {
                "id": "BOTTLED_FRUSTRATION",
                "text": "İki hafta önce yaşanan gergin konuşmada sakin kalıp karşılık vermemiştiniz. Ancak içinizde biriken kızgınlık ve hayal kırıklığı zamanla büyüdü ve motivasyonunuzu etkilemeye başladı. Arkadaşınızla olan ilişkinizde bir soğukluk hissediyorsunuz.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 14,
                "probability": 10
            }
        ]
    },
    {
        "id": "LUNCH_TABLE_CONFRONTATION",
        "text": "Öğle yemeği sırasında arkadaşlarınızla oturuyorsunuz. Bir arkadaşınız aniden sizi hedef gösterecek şekilde bir konuşma başlattı ve herkesin önünde sizi eleştirmeye başladı. Bu durum sizi sinirlendirdi. Nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -10,
            "performance": -15,
            "colleagues": -10,
            "boss": -5
        },
        "noEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": 10,
            "boss": 5
        },
        "yesText": "Aynı şekilde karşılık vereceğim",
        "noText": "Sakin kalıp sonra özel görüşeceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "PUBLIC_ARGUMENT",
                "text": "Geçen gün öğle yemeğinde bir arkadaşınızın sizi hedef alan konuşmasına karşılık vermiştiniz. Durum hızla yemek masasında büyük bir tartışmaya dönüştü. Diğer iş arkadaşlarınız rahatsız oldu ve ortam gerildi. Sonraki günlerde bu olayın dedikodusunun yapıldığını duydunuz.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -20,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 65
            },
            {
                "id": "UNEXPECTED_BACKING_DOWN",
                "text": "Karşılık verdiğinizde arkadaşınız böyle bir tepki beklemiyordu. Sözlerini geri aldı ve özür diledi. Masadaki herkes durumun çözüldüğünü görerek rahatladı.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "PRIVATE_RESOLUTION",
                "text": "Geçen hafta öğle yemeğinde sizi hedef alan arkadaşınızla, yemekten sonra özel olarak görüştünüz ve davranışının sizi nasıl etkilediğini sakin bir şekilde anlattınız. Arkadaşınız durumu anladı ve içtenlikle özür diledi. Bu olgun yaklaşımınız ikinizin de ilişkisini güçlendirdi.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 60
            },
            {
                "id": "CONTINUED_BEHAVIOR",
                "text": "Birkaç gün önce öğle yemeğinde bir arkadaşınızın sizi hedef alan konuşmasına sessiz kalmıştınız. Bu davranışınız sonucunda arkadaşınız davranışının kabul edilebilir olduğunu düşündü. Sonraki günlerde benzer durumlar yaşanmaya devam etti ve bu sizin moral ve motivasyonunuzu düşürdü.",
                "effects": {
                    "motivation": -20,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 25
            },
            {
                "id": "COLLEAGUE_SUPPORT",
                "text": "Siz sakin kaldıktan sonra, başka bir iş arkadaşınız sizin adınıza konuşarak o kişinin davranışının uygunsuz olduğunu belirtti. Masadaki diğer kişiler de bunu onayladı ve arkadaşınız küçük düştüğünü hissetti.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 20,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 15
            }
        ]
    },
    {
        "id": "LUNCH_TABLE_CONFRONTATION",
        "text": "Öğle yemeği sırasında arkadaşlarınızla oturuyorsunuz. Bir arkadaşınız aniden sizi hedef gösterecek şekilde bir konuşma başlattı ve herkesin önünde sizi eleştirmeye başladı. Bu durum sizi sinirlendirdi. Nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -10,
            "performance": -15,
            "colleagues": -10,
            "boss": -5
        },
        "noEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": 10,
            "boss": 5
        },
        "yesText": "Aynı şekilde karşılık vereceğim",
        "noText": "Sakin kalıp sonra özel görüşeceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "PUBLIC_ARGUMENT",
                "text": "Karşılık verdiniz ve durum hızla yemek masasında büyük bir tartışmaya dönüştü. Diğer iş arkadaşlarınız rahatsız oldu ve ortam gerildi. Sonraki günlerde bu olayın dedikodusunun yapıldığını duydunuz.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -20,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 65
            },
            {
                "id": "UNEXPECTED_BACKING_DOWN",
                "text": "Karşılık verdiğinizde arkadaşınız böyle bir tepki beklemiyordu. Sözlerini geri aldı ve özür diledi. Masadaki herkes durumun çözüldüğünü görerek rahatladı.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "PRIVATE_RESOLUTION",
                "text": "Yemekten sonra arkadaşınızla özel olarak görüştünüz ve davranışının sizi nasıl etkilediğini sakin bir şekilde anlattınız. Arkadaşınız durumu anladı ve içtenlikle özür diledi. Bu olgun yaklaşımınız ikinizin de ilişkisini güçlendirdi.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 60
            },
            {
                "id": "CONTINUED_BEHAVIOR",
                "text": "Yemekte sessiz kaldığınız için, arkadaşınız davranışının kabul edilebilir olduğunu düşündü. Sonraki günlerde benzer durumlar yaşanmaya devam etti ve bu sizin moral ve motivasyonunuzu düşürdü.",
                "effects": {
                    "motivation": -20,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 25
            },
            {
                "id": "COLLEAGUE_SUPPORT",
                "text": "Siz sakin kaldıktan sonra, başka bir iş arkadaşınız sizin adınıza konuşarak o kişinin davranışının uygunsuz olduğunu belirtti. Masadaki diğer kişiler de bunu onayladı ve arkadaşınız küçük düştüğünü hissetti.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 20,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 15
            }
        ]
    },
    {
        "id": "RELIGIOUS_DISAGREEMENT",
        "text": "Mola sırasında yanınızdaki iş arkadaşınız aniden dini konulara girdi ve sizin inançlarınıza veya görüşlerinize tamamen zıt fikirler paylaşmaya başladı. Nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": -10,
            "boss": -5
        },
        "noEffects": {
            "motivation": 5,
            "performance": 5,
            "colleagues": 5,
            "boss": 0
        },
        "yesText": "Kendi inançlarımı savunacağım",
        "noText": "Konuyu nazikçe değiştireceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "TENSE_DISCUSSION",
                "text": "Dini görüşlerinizi savunmaya başladığınızda tartışma gergin bir hal aldı. Diğer iş arkadaşları da söyleşiye dahil oldu ve mola alanı hararetli bir tartışma ortamına dönüştü. Bu durum gün boyunca ofisteki atmosferi olumsuz etkiledi.",
                "effects": {
                    "motivation": -15,
                    "performance": -15,
                    "colleagues": -20,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "MUTUAL_UNDERSTANDING",
                "text": "İnançlarınızı saygılı ve açık bir şekilde ifade ettiniz. Beklenmedik bir şekilde, bu durum iş arkadaşınızla aranızda farklı bakış açılarına saygı duyan, yapıcı bir diyalog başlattı ve birbirinizi daha iyi tanıma fırsatı buldunuz.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            },
            {
                "id": "ONGOING_TENSION",
                "text": "İki gün önceki tartışma sırasında dini inançlarınızı savunmanız kısa süreli bir tartışmaya yol açmasa da, bazı iş arkadaşlarınız sizinle aynı fikirde değildi. Bu durum sonraki günlerde hafif bir gerginlik yarattı ve bazı iş arkadaşlarınız dinle ilgili konuşmalarında sizin yanınızda daha temkinli davranmaya başladı.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": -10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 10
            }
        ],
        "noFollowups": [
            {
                "id": "PROFESSIONAL_BOUNDARIES",
                "text": "Nazikçe 'İş yerinde din ve siyaset hakkında konuşmamayı tercih ediyorum' diyerek konuyu değiştirdiniz. Birçok iş arkadaşınız profesyonel sınırları korumanızı takdir etti ve ofisin uyumlu atmosferi korundu.",
                "effects": {
                    "motivation": 10,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 65
            },
            {
                "id": "INSISTENT_COLLEAGUE",
                "text": "Konuyu değiştirme çabalarınıza rağmen, iş arkadaşınız dini konularda görüşlerini paylaşmaya devam etti. Rahatsızlığınız arttı ve molanın geri kalanı boyunca kendinizi huzursuz hissettiniz.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 25
            },
            {
                "id": "HR_INTERVENTION",
                "text": "İş arkadaşınız dini konularda ısrarcı olunca, başka bir çalışan durumu İK'ya bildirdi. Yönetim iş yerinde kişisel inanç tartışmalarının uygun olmadığını hatırlatan bir e-posta gönderdi. Profesyonel tavrınız takdir edildi.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 10
            }
        ]
    },
    {
        "id": "POLITICAL_DISAGREEMENT",
        "text": "Mola sırasında yanınızdaki iş arkadaşınız aniden siyasi konulara girdi ve sizin görüşlerinize tamamen zıt fikirler paylaşmaya başladı. Nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": -10,
            "boss": -5
        },
        "noEffects": {
            "motivation": 5,
            "performance": 5,
            "colleagues": 5,
            "boss": 0
        },
        "yesText": "Kendi görüşlerimi savunacağım",
        "noText": "Konuyu değiştirmeye çalışacağım",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "HEATED_DEBATE",
                "text": "Siyasi görüşlerinizi savunmaya başladığınızda tartışma kızıştı. Diğer iş arkadaşları da tartışmaya dahil oldu ve mola alanı gergin bir ortama dönüştü. Bu durum çalışma ortamını olumsuz etkiledi.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": -20,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 65
            },
            {
                "id": "RESPECTFUL_EXCHANGE",
                "text": "Görüşlerinizi sakin ve saygılı bir şekilde ifade ettiniz. İş arkadaşınız farklı bakış açılarını dinlemeye açık olduğunu gösterdi ve tartışma olgunlukla sürdü. Bu durum farklı fikirlerle başa çıkma becerinizi gösterdi.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "SMOOTH_TRANSITION",
                "text": "Ustaca konuyu değiştirerek siyasi tartışmadan kaçındınız. İş arkadaşınız mesajı aldı ve profesyonel sınırları korumayı takdir etti. Mola herkes için keyifli bir şekilde devam etti.",
                "effects": {
                    "motivation": 10,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            },
            {
                "id": "PERSISTENT_COLLEAGUE",
                "text": "Konuyu değiştirme çabalarınıza rağmen, iş arkadaşınız siyasi konulara geri dönmeye devam etti. Bu durum sizi rahatsız etti ve molanın geri kalanı boyunca gergin hissettiniz.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            }
        ]
    },
    {
        "id": "PERFORMANCE_GOSSIP",
        "text": "İşinizi iyi yapamadığınızı düşünen kişiler olduğunu ve ofiste hakkınızda dedikodular dolaştığını öğrendiniz. Bu duruma nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -5,
            "performance": 15,
            "colleagues": 0,
            "boss": 10
        },
        "noEffects": {
            "motivation": -15,
            "performance": -5,
            "colleagues": 5,
            "boss": -5
        },
        "yesText": "Performansınızı artırarak cevap vereceksiniz",
        "noText": "Dedikodu yapanları bulup konuşacaksınız",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "SILENCED_CRITICS",
                "text": "Beş gün önce, hakkınızdaki dedikodulara performansınızı artırarak cevap vermeyi seçmiştiniz. Üstün performansınız ve somut başarılarınız eleştirileri susturdu ve saygınlığınızı artırdı.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 75
            },
            {
                "id": "BURNOUT_RISK",
                "text": "Bir hafta önce, hakkınızdaki dedikodulara performansınızı artırarak cevap vermeyi seçmiştiniz. Ancak kendinizi fazla zorladınız; performansınız artsa da bu tempo sizi tüketiyor ve tükenmişlik belirtileri göstermeye başladınız.",
                "effects": {
                    "motivation": -10,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 25
            }
        ],
        "noFollowups": [
            {
                "id": "CLEARED_AIR",
                "text": "İki gün önce, hakkınızdaki dedikodular üzerine dedikodu yapanları bulup konuşmayı seçmiştiniz. Açık iletişim sayesinde yanlış anlaşılmalar giderildi, bazı yapıcı geri bildirimler aldınız ve iş ilişkileriniz iyileşti.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 40
            },
            {
                "id": "WORSENED_REPUTATION",
                "text": "Üç gün önce, hakkınızdaki dedikodular üzerine dedikodu yapanları bulup konuşmayı seçmiştiniz. Ancak bu çabanız ters tepti; savunmacı tavrınız bazılarına göre performans sorunlarınızı kabul etmediğiniz şeklinde yorumlandı ve durum daha da kötüleşti.",
                "effects": {
                    "motivation": -20,
                    "performance": -10,
                    "colleagues": -15,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 60
            }
        ]
    },
    {
        "id": "PRESENTATION_INTERNET_FAILURE",
        "text": "Üst yönetime yapacağınız önemli bir online sunum sırasında internet bağlantınız kesildi. Sunum dosyaları bulutta ve erişim sağlayamıyorsunuz. Ne yapacaksınız?",
        "yesEffects": {
            "motivation": -10,
            "performance": -5,
            "colleagues": 0,
            "boss": -5
        },
        "noEffects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": 5,
            "boss": -10
        },
        "yesText": "Sunumu ertelemeyi talep edeceksiniz",
        "noText": "Doğaçlama devam etmeyi deneyeceksiniz",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "UNDERSTANDING_MANAGEMENT",
                "text": "Önemli sunumunuz sırasında yaşadığınız internet kesintisi nedeniyle erteleme talep etmiştiniz. Yönetim anlayışla karşıladı ve teknik sorunların üstesinden gelmek için size zaman tanıdı. Yeni sunumunuz sorunsuz gerçekleşti.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 75
            },
            {
                "id": "MISSED_OPPORTUNITY",
                "text": "İnternet kesintisi nedeniyle ertelediğiniz sunumun yeni tarihi, üst yönetimin daha meşgul olduğu bir döneme denk geldi. Daha az katılımcı ve daha az ilgiyle karşılaştınız, bu da projenizin etkisini azalttı.",
                "effects": {
                    "motivation": -5,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 25
            }
        ],
        "noFollowups": [
            {
                "id": "IMPRESSIVE_IMPROVISATION",
                "text": "İnternet kesintisi sırasında doğaçlama devam etme kararınız beklenmedik bir başarıya dönüştü. Hazırlığınız ve bilginiz sayesinde etkileyici bir sunum gerçekleştirdiniz. Yönetim kriz anındaki profesyonelliğinizi takdir etti.",
                "effects": {
                    "motivation": 20,
                    "performance": 15,
                    "colleagues": 10,
                    "boss": 20
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            },
            {
                "id": "PRESENTATION_DISASTER",
                "text": "İnternet kesintisi sırasında doğaçlama devam etme çabanız başarısızlıkla sonuçlandı. Hazırlıksız yakalandınız, rakamları karıştırdınız ve sunumun ana mesajını iletemediğiniz için projenizin değeri yeterince anlaşılamadı.",
                "effects": {
                    "motivation": -15,
                    "performance": -20,
                    "colleagues": -5,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            }
        ]
    },
    {
        "id": "COWORKER_CONFLICT",
        "text": "Yakın çalıştığınız iki iş arkadaşınız arasında ciddi bir anlaşmazlık var. Her ikisi de size gelip diğerini şikayet ediyor ve sizi taraf olmaya davet ediyor. Ne yapacaksınız?",
        "yesEffects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": -5,
            "boss": 5
        },
        "noEffects": {
            "motivation": 0,
            "performance": -5,
            "colleagues": 10,
            "boss": -5
        },
        "yesText": "Haklı olduğunu düşündüğünüz kişiyi destekleyeceksiniz",
        "noText": "Tarafsız kalmaya çalışacaksınız",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "WORSENED_CONFLICT",
                "text": "Geçtiğimiz hafta iki iş arkadaşınız arasındaki anlaşmazlıkta taraf tutmuştunuz. Bu kararınız sonrası çatışma daha da büyüdü ve şimdi diğer taraf size karşı da olumsuz duygular besliyor. Ekip çalışması zorlaşıyor.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": -20,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 70
            },
            {
                "id": "JUSTIFIED_SUPPORT",
                "text": "Geçtiğimiz hafta iki iş arkadaşınız arasındaki anlaşmazlıkta bir tarafı desteklemiştiniz. Zaman sizin haklı olduğunuzu gösterdi ve yönetim de aynı kişiyi destekledi. Profesyonel muhakemeniz takdir edildi.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": -5,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 30
            }
        ],
        "noFollowups": [
            {
                "id": "MEDIATOR_ROLE",
                "text": "İki iş arkadaşınız arasındaki anlaşmazlıkta tarafsız kalmayı seçmiştiniz. Bu tavrınız sizi doğal bir arabulucu konumuna getirdi ve yardımınızla sorunlarını çözmeye başladılar.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 20,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 60
            },
            {
                "id": "BOTH_SIDES_DISAPPOINTED",
                "text": "İki iş arkadaşınız arasındaki anlaşmazlıkta tarafsız kalmayı seçmiştiniz. Ne yazık ki her iki taraf da sizin kendilerini desteklemediğiniz için hayal kırıklığına uğradı ve aradaki ilişkileriniz soğudu.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -15,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 40
            }
        ]
    },
    {
        "id": "COMPETITOR_JOB_OFFER",
        "text": "Rakip bir firmadan beklenmedik bir iş teklifi aldınız. Maaş ve pozisyon mevcut işinizden belirgin şekilde daha iyi. Ne yapacaksınız?",
        "requirements": {
            "type": "and",
            "conditions": [
                {
                    "resource": "performance",
                    "comparison": "gte",
                    "value": 70
                },
                {
                    "resource": "motivation",
                    "comparison": "gte",
                    "value": 70
                },
                {
                    "resource": "colleagues",
                    "comparison": "gte",
                    "value": 70
                },
                {
                    "resource": "boss",
                    "comparison": "gte",
                    "value": 70
                }
            ]
        },
        "yesEffects": {
            "motivation": 15,
            "performance": 5,
            "colleagues": -10,
            "boss": -20
        },
        "noEffects": {
            "motivation": -5,
            "performance": 0,
            "colleagues": 5,
            "boss": 15
        },
        "yesText": "Teklifi kabul edeceksiniz",
        "noText": "Mevcut işinizde kalacaksınız",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "COUNTEROFFER",
                "text": "Rakip firmadan aldığınız iş teklifini kabul etmeye karar vermiştiniz. İstifanızı sunduğunuzda mevcut şirketiniz beklenmedik bir karşı teklifle geldi. Şimdi daha zor bir karar vermeniz gerekiyor.",
                "yesEffects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": -5,
                    "boss": -15
                },
                "noEffects": {
                    "motivation": 5,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 25
                },
                "yesText": "Yine de rakip firmaya geçeceksiniz",
                "noText": "Karşı teklifi kabul edip kalacaksınız",
                "delay": 0,
                "probability": 65,
                "yesFollowups": [
                    {
                        "id": "NEW_JOB_SUCCESS",
                        "text": "Rakip firmaya geçme kararınızda ısrar etmiştiniz. Yeni pozisyonunuzda başarılı oldunuz ve kariyer yolunda doğru adımı attığınızı hissediyorsunuz.",
                        "effects": {
                            "motivation": 20,
                            "performance": 15,
                            "colleagues": 10,
                            "boss": 0
                        },
                        "isInfoOnly": true,
                        "delay": 10
                    }
                ],
                "noFollowups": [
                    {
                        "id": "LOYALTY_REWARDED",
                        "text": "Karşı teklifi kabul edip mevcut şirketinizde kalmaya karar vermiştiniz. Sadakatiniz takdir edildi ve yeni sorumluluklar ve imkanlarla ödüllendirildiniz.",
                        "effects": {
                            "motivation": 15,
                            "performance": 10,
                            "colleagues": 10,
                            "boss": 20
                        },
                        "isInfoOnly": true,
                        "delay": 5,
                        "probability": 70
                    },
                    {
                        "id": "TRUST_ISSUES",
                        "text": "Karşı teklifi kabul edip kalmaya karar vermiştiniz, ancak şirketiniz artık size eskisi kadar güvenmiyor. Bazı önemli projelerden dışlandığınızı hissediyorsunuz.",
                        "effects": {
                            "motivation": -15,
                            "performance": -10,
                            "colleagues": -5,
                            "boss": -10
                        },
                        "isInfoOnly": true,
                        "delay": 8,
                        "probability": 30
                    }
                ]
            },
            {
                "id": "GRASS_NOT_GREENER",
                "text": "Rakip firmadaki yeni işiniz hayal kırıklığı yarattı. Şirket kültürü size uymadı ve vaat edilen projeler gerçekleşmedi. Eski işinizi özlüyorsunuz.",
                "effects": {
                    "motivation": -20,
                    "performance": -15,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 12,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "LOYALTY_BONUS",
                "text": "Rakip firmanın cazip teklifine rağmen mevcut işinizde kalmayı seçmiştiniz. Bu sadakatiniz fark edildi ve yönetiminiz size beklenmedik bir prim ve terfi teklif etti.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 10,
                    "boss": 20
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 40
            },
            {
                "id": "MISSED_OPPORTUNITY",
                "text": "Rakip firmanın teklifini reddetmiştiniz. Şimdi duyuyorsunuz ki o pozisyona geçen kişi büyük başarılar elde etmiş ve sektörde adından söz ettiriyor. İçinizde hafif bir pişmanlık var.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 8,
                "probability": 60
            }
        ]
    },
    {
        "id": "COMPANY_RESOURCES_MISUSE",
        "text": "Yakın çalıştığınız bir iş arkadaşınızın şirket bilgisayarını ve lisanslı yazılımları kişisel projelerinde kullandığını fark ettiniz. Bu duruma nasıl yaklaşacaksınız?",
        "yesEffects": {
            "motivation": -5,
            "performance": 0,
            "colleagues": -15,
            "boss": 10
        },
        "noEffects": {
            "motivation": -10,
            "performance": -5,
            "colleagues": 10,
            "boss": -5
        },
        "yesText": "Durumu yöneticinize bildireceksiniz",
        "noText": "Arkadaşınızla özel olarak konuşacaksınız",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "WHISTLEBLOWER_FALLOUT",
                "text": "Şirket kaynaklarını kişisel amaçlarla kullanan arkadaşınızı yöneticinize bildirmiştiniz. Arkadaşınız disiplin cezası aldı ve sizin bildirdiğinizi öğrendi. Ofiste 'muhbir' olarak anılmaya başlandınız.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -25,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 60
            },
            {
                "id": "POLICY_IMPROVEMENT",
                "text": "Şirket kaynaklarının kişisel kullanımını bildirdiğiniz için yönetiminiz bu konuda tüm şirketi kapsayan yeni bir politika geliştirdi. Kimlik belirtilmeden yapılan bildiriminiz şirket kültürünün iyileşmesine katkı sağladı.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": -5,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 40
            }
        ],
        "noFollowups": [
            {
                "id": "GRATEFUL_CORRECTION",
                "text": "Şirket kaynaklarını kişisel amaçlarla kullandığını gördüğünüz arkadaşınızla konuşmuştunuz. Size teşekkür etti ve davranışını düzeltti. Aranızdaki güven ilişkisi güçlendi.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 50
            },
            {
                "id": "CONTINUED_MISUSE",
                "text": "Şirket kaynaklarını kişisel kullanımı hakkında arkadaşınızla konuşmuştunuz. Size düzelteceğini söylese de, gizlice devam ettiğini fark ettiniz. Şimdi daha zor bir durumla karşı karşıyasınız.",
                "effects": {
                    "motivation": -10,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 6,
                "probability": 50
            }
        ]
    },
    {
        "id": "TEAM_EFFORT_IMBALANCE",
        "text": "Ekip projesinde diğer üyelerin sizin kadar çaba göstermediğini fark ettiniz. Siz fazla mesaiye kalırken onlar normal mesai saatlerinde çıkıyor. Bu durumu nasıl ele alacaksınız?",
        "requirements": {
            "resource": "performance",
            "comparison": "gte",
            "value": 60
        },
        "yesEffects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": -15,
            "boss": 10
        },
        "noEffects": {
            "motivation": -15,
            "performance": -5,
            "colleagues": 5,
            "boss": -5
        },
        "yesText": "Durumu yöneticinize ileteceksiniz",
        "noText": "Kendiniz konuşmayı deneyeceksiniz",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "MANAGER_INTERVENTION",
                "text": "Yöneticiniz endişelerinizi ciddiye aldı ve ekip toplantısında iş yükü dağılımını yeniden düzenledi. Ekip üyeleri sizin şikayet ettiğinizi düşünüyor, ama en azından iş yükü artık daha dengeli.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": -20,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "DISMISSED_CONCERNS",
                "text": "Yöneticiniz durumu 'ekip içi normal dinamikler' olarak değerlendirdi ve ciddi bir müdahalede bulunmadı. Ekip üyeleri sizin şikayet ettiğinizi öğrendi ve artık size karşı daha mesafeli davranıyorlar.",
                "effects": {
                    "motivation": -20,
                    "performance": -15,
                    "colleagues": -25,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            }
        ],
        "noFollowups": [
            {
                "id": "PRODUCTIVE_DISCUSSION",
                "text": "Ekip üyeleriyle yaptığınız konuşma beklenmedik şekilde verimli geçti. Herkes kendi durumunu açıkladı ve iş yükünün daha adil dağıtılması için birlikte çözümler geliştirdiniz.",
                "effects": {
                    "motivation": 20,
                    "performance": 15,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            },
            {
                "id": "DEFENSIVE_TEAM",
                "text": "Ekip üyeleri eleştirinizi savunmayla karşıladı. Bazıları sizin mikroyönetim yaptığınızı, bazıları ise sadece göze girmeye çalıştığınızı düşünüyor. Ekip içi ilişkiler gerginleşti.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -20,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 45
            },
            {
                "id": "CONTINUED_IMBALANCE",
                "text": "Ekip sizi dinledi, anladıklarını söyledi, ama hiçbir şey değişmedi. Hala en çok çalışan sizsiniz ve bu durum sizi giderek daha fazla yıpratıyor.",
                "effects": {
                    "motivation": -25,
                    "performance": -15,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 20
            }
        ]
    },
    {
        "id": "INVADED_PRIVACY",
        "text": "Yanınızda oturan ve pek samimi olmadığınız iş arkadaşınızın masanızdaki çekmecenizi izinsiz karıştırdığını fark ettiniz. Nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": -10,
            "boss": 5
        },
        "noEffects": {
            "motivation": -10,
            "performance": -5,
            "colleagues": 0,
            "boss": -5
        },
        "yesText": "Konuyu doğrudan onunla konuşacağım",
        "noText": "Şimdilik görmezden geleceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "EMBARRASSED_APOLOGY",
                "text": "İş arkadaşınızla sakin bir şekilde konuştunuz. Sadece bir kalem aradığını söyleyerek özür diledi. Sınırlarınızı belirlemiş olmanız ikiniz için de iyi oldu.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 55
            },
            {
                "id": "DEFENSIVE_REACTION",
                "text": "Bir gün önce, çekmecenizi karıştıran iş arkadaşınızla doğrudan konuşmayı seçmiştiniz. Ancak konuyu gündeme getirdiğinizde savunmaya geçti ve abartıyorsunuz diyerek sizi suçladı. Ofiste gergin bir durum oluştu ve bazı iş arkadaşlarınız olay hakkında dedikodu yapmaya başladı.",
                "effects": {
                    "motivation": -10,
                    "performance": -10,
                    "colleagues": -15,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 35
            },
            {
                "id": "MANAGER_ESCALATION",
                "text": "Konuşmanız sırasında tartışma büyüdü ve yöneticiniz müdahale etmek zorunda kaldı. Yöneticiniz özel alana saygı konusunda tüm ekibe bir hatırlatma yaptı.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": -5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 10
            }
        ],
        "noFollowups": [
            {
                "id": "REPEATED_BEHAVIOR",
                "text": "Üç gün önce, çekmecenizin karıştırılmasını görmezden gelmeyi seçmiştiniz. Ancak iş arkadaşınız bunu bir izin olarak algıladı. Artık düzenli olarak eşyalarınızı izinsiz kullanıyor ve bu durum sizi her geçen gün daha çok rahatsız ediyor.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 70
            },
            {
                "id": "ONE_TIME_INCIDENT",
                "text": "İki gün önce, çekmecenizin karıştırılmasını görmezden gelmeyi seçmiştiniz. Bu stratejiniz işe yaradı; iş arkadaşınız bir daha çekmecenizi karıştırmadı ve olay unutulup gitti.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 30
            }
        ]
    },
    {
        "id": "LATE_MEETING_REQUEST",
        "text": "Yöneteceğiniz toplantı saati geldiğinde, iki katılımcı size yaklaşıp toplantıdan önce son bir sigara içmek için 10 dakika izin istedi. Ne yaparsınız?",
        "requirements": {
            "resource": "boss",
            "comparison": "gte",
            "value": 35
        },
        "yesEffects": {
            "motivation": 5,
            "performance": -10,
            "colleagues": 10,
            "boss": -5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 10,
            "colleagues": -5,
            "boss": 5
        },
        "yesText": "Tamam, 10 dakika bekleriz",
        "noText": "Hayır, zamanında başlamalıyız",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "PRECEDENT_SET",
                "text": "Sigara molasına izin vermeniz bir emsal oluşturdu. Sonraki toplantılarınızda da benzer gecikmeler yaşanmaya başladı ve zamanla tüm toplantılarınız düzenli olarak geç başlar hale geldi.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": 5,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 70
            },
            {
                "id": "TEAM_APPRECIATION",
                "text": "Bu küçük jestten sonra toplantı katılımcıları daha enerjik ve katılımcı oldu. Toplantı verimli geçti, ancak unutmayın ki bu bir istisnaydı.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            }
        ],
        "noFollowups": [
            {
                "id": "PROFESSIONAL_RESPECT",
                "text": "Kararlı tavrınız takdir gördü. Katılımcılar zamanında toplantıya girmek zorunda kaldı ve bu profesyonel tavır ileriki toplantılarınızda da örnek teşkil etti.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 65
            },
            {
                "id": "RESENTFUL_ATMOSPHERE",
                "text": "Toplantıya katılan bazı kişiler sigara molasına izin vermemenizden dolayı rahatsız oldu. Toplantı boyunca gergin bir atmosfer hakimdi ve katılım düşüktü.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -15,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            }
        ]
    },
    {
        "id": "IMPATIENT_COLLEAGUE",
        "text": "Bir iş arkadaşınız bir projeyi incelemenizi rica etti. Gün içerisinde bakacağınızı söylemenize rağmen, son birkaç saatte üç kez size gelip inceleyip incelemediğinizi sordu. Bu duruma nasıl tepki vereceksiniz?",
        "yesEffects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": 10,
            "boss": 0
        },
        "noEffects": {
            "motivation": 0,
            "performance": 5,
            "colleagues": -10,
            "boss": 0
        },
        "yesText": "İşimi bırakıp hemen inceleyeceğim",
        "noText": "Sabırlı olması gerektiğini söyleyeceğim",
        "maxUses": 3,
        "yesFollowups": [
            {
                "id": "IMMEDIATE_RELIEF",
                "text": "Kendi işinizi bir kenara bırakıp arkadaşınızın projesini hemen incelediniz. Arkadaşınız minnettarlığını ifade etti ve rahatladı. Ancak kendi görevleriniz birikmeye başladı.",
                "effects": {
                    "motivation": -5,
                    "performance": -15,
                    "colleagues": 15,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 65
            },
            {
                "id": "PRECEDENT_SET",
                "text": "Acil olmayan işi hemen hallettiğiniz için, arkadaşınız sonraki haftalarda da benzer taleplerle size gelmeye başladı. Sürekli kendi işinizi bölmek zorunda kalıyorsunuz.",
                "effects": {
                    "motivation": -10,
                    "performance": -20,
                    "colleagues": 5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "PROFESSIONAL_BOUNDARIES",
                "text": "Arkadaşınıza profesyonel bir şekilde gün içinde bakacağınızı ve sürekli hatırlatmanın işinizi yavaşlattığını açıkladınız. İlk başta alındı ama sonradan sınırlarınıza saygı duymaya başladı.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": -5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "URGENT_MATTER",
                "text": "Arkadaşınıza sabırlı olması gerektiğini söylediğinizde çok sinirlendi. Meğer proje üst yönetim tarafından acil isteniyormuş ve size bu bilgiyi vermemiş. İkiniz de zor durumda kaldınız.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -15,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            }
        ]
    },
    {
        "id": "MISSING_GREETING",
        "text": "Her sabah size günaydın diyen çalışma arkadaşınız bugün selam vermedi. Bu duruma nasıl yaklaşacaksınız?",
        "yesEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": -10,
            "boss": 0
        },
        "noEffects": {
            "motivation": 0,
            "performance": 5,
            "colleagues": 5,
            "boss": 0
        },
        "yesText": "Bir sorun olmalı, nedenini araştıracağım",
        "noText": "Belki yoğundur, çok düşünmeyeceğim",
        "maxUses": 3,
        "yesFollowups": [
            {
                "id": "OVERTHINKING_CONSEQUENCES",
                "text": "Arkadaşınızla konuşmak için bir fırsat yaratıp günaydın dememesinin sebebini sordunuz. Size garip garip baktı ve basitçe 'Sabahları çok meşgulüm, her zaman selamlayamayabilirim' dedi. Arkadaşınız bu aşırı tepkiniz karşısında rahatsız oldu.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -15,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "GENUINE_PROBLEM",
                "text": "Arkadaşınızla konuştuğunuzda gerçekten de kişisel bir sorun yaşadığını öğrendiniz. İlgilenmeniz onu duygulandırdı ve bu küçük jest aranızdaki bağı güçlendirdi.",
                "effects": {
                    "motivation": 10,
                    "performance": 0,
                    "colleagues": 15,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            }
        ],
        "noFollowups": [
            {
                "id": "NORMAL_DAY",
                "text": "Çok düşünmemeye karar verdiniz ve günlük işlerinize odaklandınız. Öğleden sonra arkadaşınız size yaklaşıp sabah selam veremediği için özür diledi, acil bir toplantıya yetişmeye çalışıyormuş. Sakin yaklaşımınız doğru bir tercih oldu.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 75
            },
            {
                "id": "MISSED_SIGNAL",
                "text": "Her sabah size günaydın diyen iş arkadaşınızın selamını önemsemeyip geçmiştiniz. Birkaç gün sonra aynı arkadaşınızın ciddi kişisel sorunlar yaşadığını öğrendiniz. Belki de o gün yardıma ihtiyacı vardı ve siz fark etmediniz. Biraz suçluluk hissediyorsunuz.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 25
            }
        ]
    },
    {
        "id": "RELATIONSHIP_BREAKDOWN",
        "text": "İş yerindeki partnerinizle ilişkinizde sorunlar baş gösterdi. İlişkiyi kurtarmak için çaba gösterecek misiniz?",
        "yesEffects": {
            "motivation": -10,
            "performance": -15,
            "colleagues": 0,
            "boss": -5
        },
        "noEffects": {
            "motivation": -15,
            "performance": 10,
            "colleagues": -5,
            "boss": 5
        },
        "yesText": "İlişkiyi kurtarmak için çabalayacağım",
        "noText": "İlişkinin bitmesine izin vereceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "FUTILE_EFFORTS",
                "text": "İş yerindeki partnerinizle ilişkinizi kurtarmak için çaba göstermiştiniz. Tüm çabalarınıza rağmen, partneriniz kararını vermiş. İlişki acı verici bir şekilde sona erdi ve şimdi her gün iş yerinde bu kişiyle karşılaşmak zorunda kalıyorsunuz.",
                "effects": {
                    "motivation": -25,
                    "performance": -15,
                    "colleagues": -10,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 80
            },
            {
                "id": "TEMPORARY_RECONCILIATION",
                "text": "İş yerindeki partnerinizle ilişkinizi kurtarmak için gösterdiğiniz çabalar kısa süreliğine işe yaradı, ancak sorunlar devam ediyor. İlişki her an patlama noktasına gelebilir ve bu belirsizlik konsantrasyonunuzu bozuyor.",
                "effects": {
                    "motivation": -10,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 20
            }
        ],
        "noFollowups": [
            {
                "id": "PAINFUL_CLOSURE",
                "text": "İş yerindeki partnerinizle ilişkinizin bitmesine izin vermiştiniz. Bu kararın ardından içinizde büyük bir boşluk var ve iş yerinde bu kişiyi görmek her gün acı veriyor.",
                "effects": {
                    "motivation": -20,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 60
            },
            {
                "id": "PROFESSIONAL_RECOVERY",
                "text": "İş yerindeki partnerinizle ilişkinizin bitmesine izin vermiştiniz. Bu zor kararın ardından, zaman içinde duygusal açıdan toparlanmaya başladınız. İşinize odaklanmak size iyi geldi ve performansınız artmaya başladı.",
                "effects": {
                    "motivation": 5,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 40
            }
        ]
    },
    {
        "id": "OFFICE_CRUSH_DEVELOPMENT",
        "text": "Son birkaç aydır ofiste birlikte çalıştığınız kişiye karşı duygular geliştirmeye başladınız. Hislerinizi açmayı düşünüyorsunuz. Ne yaparsınız?",
        "requirements": {
            "resource": "motivation",
            "comparison": "gte",
            "value": 40
        },
        "yesEffects": {
            "motivation": 15,
            "performance": -5,
            "colleagues": -5,
            "boss": -5
        },
        "noEffects": {
            "motivation": -10,
            "performance": 5,
            "colleagues": 0,
            "boss": 0
        },
        "yesText": "Hislerimi açacağım",
        "noText": "Profesyonel kalmalıyım",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "MUTUAL_FEELINGS",
                "text": "Ofiste birlikte çalıştığınız kişiye karşı duygularınızı açmıştınız. Cesur adımınız karşılık buldu ve karşınızdaki kişinin de size benzer hisler beslediğini öğrendiniz. İkiniz de bu durumdan mutlusunuz.",
                "effects": {
                    "motivation": 20,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 75
            },
            {
                "id": "AWKWARD_REJECTION",
                "text": "Ofiste birlikte çalıştığınız kişiye duygularınızı açmıştınız. Maalesef karşınızdaki kişi aynı hisleri paylaşmıyor. Şimdi her gün ofiste karşılaşmak biraz garip ve rahatsız edici oluyor.",
                "effects": {
                    "motivation": -20,
                    "performance": -15,
                    "colleagues": -10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 25
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_OPPORTUNITY",
                "text": "Ofisteki iş arkadaşınıza karşı hislerinizi açmak yerine profesyonel kalmayı seçmiştiniz. Aradan geçen günlerde kendinizi üzgün hissediyorsunuz. Acaba karşı taraf da sizinle aynı şeyleri mi hissediyordu?",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 65
            },
            {
                "id": "PROFESSIONAL_RELIEF",
                "text": "Ofisteki iş arkadaşınıza karşı duygularınızı açmayıp profesyonel kalmayı seçmiştiniz. Bu kararınızın ardından iş yerinde duygusal karışıklık yaşamadığınız için rahatladınız. İşinize odaklanmanız daha kolay oldu.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 35
            }
        ]
    },
    {
        "id": "ONE_TIME_COFFEE_BREAK",
        "text": "Arkadaşlarınız sizi kahve molasına davet etti. Katılmak ister misiniz?",
        "yesEffects": {
            "motivation": 15,
            "performance": -15,
            "colleagues": 10,
            "boss": -10
        },
        "noEffects": {
            "motivation": -5,
            "performance": 10,
            "colleagues": -5,
            "boss": 5
        },
        "yesText": "Katıl",
        "noText": "Nazikçe reddet",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "PRODUCTIVE_BREAK",
                "text": "Kahve molası beklediğinizden daha verimli geçti. İş arkadaşlarınızla yaptığınız sohbette yeni fikirler edindiniz.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "EXTENDED_ABSENCE",
                "text": "Kahve molası planlanandan uzun sürdü ve önemli bir toplantıyı kaçırdınız. Yöneticiniz bundan pek memnun olmadı.",
                "effects": {
                    "motivation": -5,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            }
        ],
        "noFollowups": [
            {
                "id": "FOCUSED_WORK",
                "text": "Kahve molasını reddederek işinize odaklandınız ve önemli bir görevi zamanından önce bitirdiniz.",
                "effects": {
                    "motivation": 5,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            },
            {
                "id": "MISSED_INFORMATION",
                "text": "Katılmadığınız kahve molasında önemli bir proje hakkında gayri resmi bilgiler paylaşıldı ve siz bunu kaçırdınız.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 30
            }
        ]
    },
    {
        "id": "ONE_TIME_OVERTIME_REQUEST",
        "text": "Yöneticiniz bu hafta sonu fazla mesai yapmanızı rica ediyor. Önemli bir proje teslimi var.",
        "yesEffects": {
            "motivation": -15,
            "performance": 10,
            "colleagues": 0,
            "boss": 20
        },
        "noEffects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 0,
            "boss": -15
        },
        "yesText": "Kabul et",
        "noText": "Reddet",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "PROJECT_SUCCESS",
                "text": "Fazla mesai sayesinde proje zamanında tamamlandı ve yöneticiniz katkınızı takdir etti.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 75
            },
            {
                "id": "BURNOUT_SYMPTOMS",
                "text": "Hafta sonu mesaisi sizi fazlasıyla yordu ve haftaya yorgun başladınız.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 25
            }
        ],
        "noFollowups": [
            {
                "id": "REFRESHED_RETURN",
                "text": "Hafta sonunuzu dinlenerek geçirdiniz ve haftaya enerji dolu başladınız.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 40
            },
            {
                "id": "PROJECT_DELAY",
                "text": "Sizin yokluğunuzda proje tamamlanamadı ve teslim tarihi ertelendi. Yöneticiniz hayal kırıklığına uğradı.",
                "effects": {
                    "motivation": -5,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 60
            }
        ]
    },
    {
        "id": "ONE_TIME_COLLEAGUE_HELP",
        "text": "Bir iş arkadaşınız acil bir projesinde yardım istiyor. Kendi işleriniz de yoğun.",
        "yesEffects": {
            "motivation": 5,
            "performance": -10,
            "colleagues": 15,
            "boss": 0
        },
        "noEffects": {
            "motivation": 0,
            "performance": 10,
            "colleagues": -10,
            "boss": 0
        },
        "yesText": "Yardım et",
        "noText": "Şu an yapamayacağını söyle",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "MUTUAL_SUPPORT",
                "text": "Yardımınız sayesinde iş arkadaşınız projesini tamamladı ve ileride size yardım etmeyi teklif etti.",
                "effects": {
                    "motivation": 10,
                    "performance": 0,
                    "colleagues": 10,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 65
            },
            {
                "id": "WORK_OVERLOAD",
                "text": "İş arkadaşınıza yardım etmek kendi görevlerinizi tamamlamanızı zorlaştırdı ve stres seviyeniz yükseldi.",
                "effects": {
                    "motivation": -15,
                    "performance": -15,
                    "colleagues": 5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "TASK_FOCUS",
                "text": "Kendi işlerinize odaklanarak tüm görevlerinizi zamanında tamamladınız.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 70
            },
            {
                "id": "COLLEAGUE_DISAPPOINTMENT",
                "text": "İş arkadaşınız yardım etmediğiniz için hayal kırıklığına uğradı ve bu durum aranızdaki ilişkiyi olumsuz etkiledi.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": -15,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            }
        ]
    },
    {
        "id": "ONE_TIME_IDEA_SHARING",
        "text": "Toplantı sırasında aklınıza yaratıcı bir fikir geldi, ancak paylaşmaktan çekiniyorsunuz.",
        "yesEffects": {
            "motivation": 10,
            "performance": 5,
            "colleagues": 5,
            "boss": 10
        },
        "noEffects": {
            "motivation": -5,
            "performance": 0,
            "colleagues": 0,
            "boss": -5
        },
        "yesText": "Fikrini paylaş",
        "noText": "Sessiz kal",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "IDEA_APPRECIATION",
                "text": "Fikriniz toplantıda büyük ilgi gördü ve yöneticiniz yaratıcılığınızı takdir etti.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 10,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "MIXED_RECEPTION",
                "text": "Fikriniz bazı eleştiriler aldı, ancak yapıcı tartışmalara yol açtı ve sonuçta olumlu bir katkı olarak görüldü.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            },
            {
                "id": "NEGATIVE_FEEDBACK",
                "text": "Fikriniz beklendiği kadar iyi karşılanmadı ve bazı meslektaşlarınız eleştirel yaklaştı.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 10
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_OPPORTUNITY",
                "text": "Daha sonra toplantıdan çıkarken, birinin sizin aklınızdaki fikre benzer bir öneri sunduğunu ve bunun kabul gördüğünü fark ettiniz.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            },
            {
                "id": "RELIEF_FEELING",
                "text": "Toplantı sonrası düşününce, fikrinizin tam olgunlaşmadığını fark ettiniz ve sessiz kalmakla doğru seçim yaptığınızı düşündünüz.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 30
            }
        ]
    },
    {
        "id": "ONE_TIME_CAREER_OPPORTUNITY",
        "text": "Başka bir birime transfer teklifi aldınız. Yeni pozisyon hem terfi hem de maaş artışı içeriyor ama yeni bir ekiple çalışmak zorunda kalacaksınız.",
        "yesEffects": {
            "motivation": 20,
            "performance": 10,
            "colleagues": -15,
            "boss": 5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": 15,
            "boss": 0
        },
        "yesText": "Teklifi kabul et",
        "noText": "Mevcut pozisyonunda kal",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "SUCCESSFUL_TRANSITION",
                "text": "Yeni pozisyona geçişiniz sorunsuz oldu ve kısa sürede yeni ekibe adapte oldunuz. Kariyer adımınızdan memnunsunuz.",
                "effects": {
                    "motivation": 15,
                    "performance": 15,
                    "colleagues": 10,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 55
            },
            {
                "id": "ADJUSTMENT_CHALLENGES",
                "text": "Yeni pozisyonunuzda beklenmedik zorluklarla karşılaştınız ve uyum sağlamak düşündüğünüzden daha zor oldu.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 45
            }
        ],
        "noFollowups": [
            {
                "id": "COMFORT_ZONE",
                "text": "Mevcut pozisyonunuzda kalmaya karar verdiniz ve tanıdık ortamda çalışmaya devam etmek size huzur verdi.",
                "effects": {
                    "motivation": 10,
                    "performance": 10,
                    "colleagues": 10,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 60
            },
            {
                "id": "PROMOTION_REGRET",
                "text": "Terfi teklifini reddettiğiniz için pişmanlık duymaya başladınız ve kariyerinizde ilerlemek için kaçırdığınız fırsatı düşünüyorsunuz.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 40
            }
        ]
    },
    {
        "id": "COLLEAGUE_ROMANCE",
        "text": "Son birkaç aydır aynı projede çalıştığınız takım arkadaşınızın size ilgi duyduğunu hissediyorsunuz. Bugün size mesai sonrası bir şeyler içmeyi teklif etti. Kabul eder misiniz?",
        "requirements": {
            "resource": "motivation",
            "comparison": "gte",
            "value": 40
        },
        "yesEffects": {
            "motivation": 15,
            "performance": -5,
            "colleagues": -5,
            "boss": -5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 0,
            "colleagues": 0,
            "boss": 0
        },
        "yesText": "Evet, kabul ederim",
        "noText": "Hayır, iş arkadaşlarıyla flört etmem",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "ROMANCE_BLOSSOMS",
                "text": "Güzel bir akşam geçirdiniz ve ortak ilgi alanlarınızın çok olduğunu keşfettiniz. İkiniz arasında bir şeyler gelişmeye başlıyor.",
                "effects": {
                    "motivation": 20,
                    "performance": 10,
                    "colleagues": -10,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            },
            {
                "id": "AWKWARD_AFTERMATH",
                "text": "Buluşma beklendiği gibi geçmedi ve şimdi aynı projede çalışmak biraz garip bir hal aldı.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            }
        ],
        "noFollowups": [
            {
                "id": "RELIEF_FEELING",
                "text": "Teklifi reddettiğiniz için rahatlama hissettiniz. İş ve özel hayatı karıştırmamak sizin için önemli.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "MISSED_OPPORTUNITY",
                "text": "İçinizde bir pişmanlık var. Belki de gerçekten iyi anlaşabileceğiniz biriydi.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            }
        ]
    },
    {
        "id": "DIFFERENT_DEPARTMENT_CRUSH",
        "text": "Kafeteryada farklı birimden biriyle sürekli göz göze geliyorsunuz. Bugün yanına gidip konuşmayı düşündünüz. Adım atacak mısınız?",
        "requirements": {
            "resource": "colleagues",
            "comparison": "gte",
            "value": 30
        },
        "yesEffects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 5,
            "boss": 0
        },
        "noEffects": {
            "motivation": -5,
            "performance": 0,
            "colleagues": 0,
            "boss": 0
        },
        "yesText": "Evet, tanışmalıyım",
        "noText": "Hayır, çekiniyorum",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "SUCCESSFUL_INTRODUCTION",
                "text": "Tanışmanız çok iyi geçti! Birlikte öğle yemeği yemeye karar verdiniz ve sohbet çok keyifliydi.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "AWKWARD_MEETING",
                "text": "Tanışmanız biraz garip oldu. Karşınızdaki kişi ilgili görünmüyordu ve hızlıca uzaklaştı.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_CONNECTION",
                "text": "Kafetaryada sürekli göz göze geldiğiniz ama konuşmaya çekindiğiniz o kişinin bir başkasıyla konuştuğunu gördünüz. Bir fırsatı kaçırdığınızı düşünüyorsunuz.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 50
            },
            {
                "id": "FUTURE_OPPORTUNITY",
                "text": "Birkaç gün sonra şirket içi bir etkinlikte kafetaryada sürekli göz göze geldiğiniz ama konuşmaya çekindiğiniz kişiyle tanışma fırsatı buldunuz ve iyi anlaştınız.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 50
            }
        ]
    },
    {
        "id": "TEAM_BUILDING_ROMANCE",
        "text": "Ekip kaynaşma aktivitesinde, uzun zamandır beğendiğiniz kişi sizinle eşleşmek istediğini söylüyor. Kabul eder misiniz?",
        "requirements": {
            "type": "or",
            "conditions": [
                {
                    "resource": "motivation",
                    "comparison": "gte",
                    "value": 45
                },
                {
                    "resource": "colleagues",
                    "comparison": "gte",
                    "value": 50
                }
            ]
        },
        "yesEffects": {
            "motivation": 15,
            "performance": 0,
            "colleagues": 0,
            "boss": -5
        },
        "noEffects": {
            "motivation": -10,
            "performance": 0,
            "colleagues": 0,
            "boss": 0
        },
        "yesText": "Evet, birlikte çalışalım",
        "noText": "Hayır, başka biriyle eşleşmek istiyorum",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "PERFECT_CHEMISTRY",
                "text": "Aktivite boyunca ikiniz arasında harika bir uyum yakaladınız. İş dışında da görüşmek için planlar yapıyorsunuz.",
                "effects": {
                    "motivation": 20,
                    "performance": 10,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            },
            {
                "id": "OFFICE_GOSSIP",
                "text": "Aktivitedeki yakınlığınız ofis dedikodusunun konusu oldu. Bazı arkadaşlarınız sizinle bu konuda şakalaşıyor.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": -10,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 30
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_CONNECTION",
                "text": "Teklifi reddettiğinize pişman oldunuz. O kişi başka biriyle eşleşti ve çok iyi anlaştılar.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "PROFESSIONAL_BOUNDARY",
                "text": "Teklifi nazikçe reddettiğiniz için rahatladınız. İş ilişkilerinizi profesyonel düzeyde tutmak sizin için önemliydi.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 40
            }
        ]
    },
    {
        "id": "AFTER_HOURS_DATE",
        "text": "İş dışında tanışıp flört etmeye başladığınız kişi, beklenmedik bir şekilde çalıştığınız birime transfer oldu. Aynı bölümde çalışacak olmanıza rağmen ilişkinizi sürdürmek ister misiniz?",
        "requirements": {
            "type": "and",
            "conditions": [
                {
                    "resource": "motivation",
                    "comparison": "gte",
                    "value": 40
                },
                {
                    "resource": "performance",
                    "comparison": "gte",
                    "value": 50
                }
            ]
        },
        "yesEffects": {
            "motivation": 15,
            "performance": -10,
            "colleagues": -5,
            "boss": -10
        },
        "noEffects": {
            "motivation": -15,
            "performance": 5,
            "colleagues": 0,
            "boss": 5
        },
        "yesText": "Evet, ilişkimizi sürdüreceğim",
        "noText": "Hayır, profesyonellik adına bitireceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "BALANCING_ACT",
                "text": "Bölümünüze transfer olan flörtünüzle ilişkinizi sürdürme kararınız iş hayatı ve özel hayatınızı dengelemek için ekstra çaba sarf etmenize sebep oluyor. Zorlu olsa da şimdilik bu denge stratejiniz işe yarıyor gibi görünüyor.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 40
            },
            {
                "id": "RELATIONSHIP_STRAIN",
                "text": "Bölümünüze transfer olan flörtünüzle ilişkinizi sürdürme kararınız beklemediğiniz zorluklara yol açtı. İş stresi, rekabet ve dedikodular romantik bağınızı test ediyor.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 30
            },
            {
                "id": "OFFICIAL_DISCLOSURE",
                "text": "Bölümünüze transfer olan flörtünüzle ilişkinizi sürdürme kararınızın ardından durumu İK birimine bildirdiniz. Şeffaflığınız sayesinde hem yöneticiniz hem de ekibiniz durumu anlayışla karşıladı.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 30
            }
        ],
        "noFollowups": [
            {
                "id": "FREEDOM_FOCUS",
                "text": "Bölümünüze transfer olan flörtünüzle ilişkinizi sonlandırma kararınız kariyer hedeflerinize daha iyi odaklanmanızı sağladı. Profesyonel yaşamınız için doğru tercihi yaptığınızı hissediyorsunuz.",
                "effects": {
                    "motivation": 5,
                    "performance": 15,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 50
            },
            {
                "id": "EMOTIONAL_AFTERMATH",
                "text": "Bölümünüze transfer olan flörtünüzle ilişkinizi bitirme kararınız sizi tahmin ettiğinizden daha derinden etkiledi. Her gün aynı ofiste o kişiyle karşılaşmak duygusal olarak yıpratıcı oluyor.",
                "effects": {
                    "motivation": -20,
                    "performance": -15,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 50
            }
        ]
    },
    {
        "id": "SECRET_ADMIRER",
        "text": "Masanızda isimsiz bir not buldunuz. Birinin size gizli bir hayranlık beslediğini gösteriyor. Kim olduğunu bulmaya çalışacak mısınız?",
        "yesEffects": {
            "motivation": 10,
            "performance": -10,
            "colleagues": 0,
            "boss": -5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": 0,
            "boss": 0
        },
        "yesText": "Evet, merak ediyorum",
        "noText": "Hayır, görmezden geleceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "PLEASANT_SURPRISE",
                "text": "Üç gün önce bulduğunuz nota dair başlattığınız araştırma sonuç verdi! Hayranınız uzun zamandır beğendiğiniz biri çıktı. Birlikte kahve içmeye karar verdiniz.",
                "effects": {
                    "motivation": 20,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 40
            },
            {
                "id": "UNEXPECTED_ADMIRER",
                "text": "İsimsiz not bırakan hayranınızın kim olduğunu öğrendiniz ama bu kişi hiç beklemediğiniz biriydi. Bu durumu nasıl ele alacağınızı bilmiyorsunuz.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 40
            },
            {
                "id": "PRACTICAL_JOKE",
                "text": "Üç gün önce masanıza bırakılan notun aslında bir şaka olduğu ortaya çıktı. Bazı iş arkadaşlarınız sizi kızdırmak istemiş.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -15,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 20
            }
        ],
        "noFollowups": [
            {
                "id": "MYSTERY_CONTINUES",
                "text": "Masanıza bırakılan isimsiz notu görmezden gelmiştiniz ama yeni notlar gelmeye devam ediyor. İçinizde büyüyen bir merak var.",
                "effects": {
                    "motivation": 5,
                    "performance": -5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 60
            },
            {
                "id": "ADMIRER_REVEALED",
                "text": "Masanıza bırakılan isimsiz notun sahibini siz aramaya çalışmasanız da sonunda hayranınız kendini açığa çıkardı ve kahve içmek için sizi davet etti.",
                "effects": {
                    "motivation": 10,
                    "performance": 0,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 40
            }
        ]
    },
    {
        "id": "PEER_FEEDBACK",
        "text": "Çalışma arkadaşlarınızdan birinden işinizle ilgili yapıcı eleştiri içeren geri bildirim aldınız. Bu geri bildirimi nasıl karşılarsınız?",
        "yesEffects": {
            "motivation": 5,
            "performance": 15,
            "colleagues": 10,
            "boss": 5
        },
        "noEffects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": -15,
            "boss": -5
        },
        "yesText": "Geri bildirimi dikkate al ve iyileştir",
        "noText": "Eleştiriyi görmezden gel",
        "yesFollowups": [
            {
                "id": "PROFESSIONAL_GROWTH",
                "text": "Beş gün önce, iş arkadaşınızdan gelen geri bildirimi dikkate alıp iyileştirmeyi seçmiştiniz. Bu yapıcı yaklaşımınız sayesinde işinizde önemli iyileştirmeler yaptınız ve bu durum ekip içinde takdir topladı.",
                "effects": {
                    "motivation": 15,
                    "performance": 20,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 80
            },
            {
                "id": "MISGUIDED_ADVICE",
                "text": "Dört gün önce, iş arkadaşınızdan gelen geri bildirimi dikkate alıp iyileştirmeyi seçmiştiniz. Ancak geri bildirimi uyguladığınızda sonuçlar beklendiği gibi olmadı ve kendi yaklaşımınızın daha uygun olduğu ortaya çıktı.",
                "effects": {
                    "motivation": -5,
                    "performance": -10,
                    "colleagues": 5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 20
            }
        ],
        "noFollowups": [
            {
                "id": "PERSISTENT_ISSUES",
                "text": "Altı gün önce, iş arkadaşınızdan gelen eleştiriyi görmezden gelmeyi seçmiştiniz. Bu kararınız nedeniyle aynı sorunlar devam etti ve performans değerlendirmenizde belirtildi.",
                "effects": {
                    "motivation": -15,
                    "performance": -15,
                    "colleagues": -10,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 6,
                "probability": 75
            },
            {
                "id": "INDEPENDENT_IMPROVEMENT",
                "text": "Sekiz gün önce, iş arkadaşınızdan gelen eleştiriyi görmezden gelmeyi seçmiştiniz. Kendi yöntemlerinizle çalışmaya devam ederek zamanla kendi yaklaşımınızı iyileştirdiniz ve başarılı oldunuz.",
                "effects": {
                    "motivation": 10,
                    "performance": 10,
                    "colleagues": -5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 8,
                "probability": 25
            }
        ]
    },
    {
        "id": "NEW_TECHNOLOGY",
        "text": "Kurumunuzda yeni bir teknolojiye geçiş yapılıyor. Kullanımı öğrenmek için ekstra zaman ayırmak gerekecek. Hemen adapte olmak ister misiniz?",
        "yesEffects": {
            "motivation": 5,
            "performance": -10,
            "colleagues": 10,
            "boss": 15
        },
        "noEffects": {
            "motivation": 10,
            "performance": 5,
            "colleagues": -5,
            "boss": -10
        },
        "yesText": "Hemen öğrenmeye başla",
        "noText": "Adapte olmayı ertele",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "EARLY_ADOPTER",
                "text": "eçilmesi planlanan yeni teknolojiye hızla adapte olarak ekipte öncü oldunuz ve diğerlerine de mentorluk yapmaya başladınız.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 20
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 60
            },
            {
                "id": "LEARNING_CURVE_STRUGGLE",
                "text": "Geçilmesi planlanan yeni teknolojiye erkenden adapte olmak düşündüğünüzden daha zor oluyor ve bu süreçte veriminiz düştü.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 40
            }
        ],
        "noFollowups": [
            {
                "id": "LEFT_BEHIND",
                "text": "Kurumunuzda yeni bir teknolojiye geçiş yapılacağını öğrendikten sonra adapte olmayı ertelemeyi seçmiştiniz. Adapte olmayı ertelediğiniz için ekipten geri kaldınız ve yeni projelerden dışlandınız.",
                "effects": {
                    "motivation": -20,
                    "performance": -15,
                    "colleagues": -10,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 65
            },
            {
                "id": "EFFICIENT_APPROACH",
                "text": "Kurumunuzda yeni bir teknolojiye geçiş yapılacağını öğrendikten sonra adapte olmayı ertelemeyi seçmiştiniz. Bekleme stratejiniz işe yaradı, başkalarının hatalarından öğrenerek daha verimli bir şekilde adapte oldunuz.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 8,
                "probability": 35
            }
        ]
    },
    {
        "id": "WORKPLACE_DISAGREEMENT",
        "text": "Bir çalışma toplantısında meslektaşınızla teknik bir konuda ciddi fikir ayrılığı yaşadınız. Kendi bakış açınızı savunmak için ısrar eder misiniz?",
        "yesEffects": {
            "motivation": 5,
            "performance": 0,
            "colleagues": -10,
            "boss": 0
        },
        "noEffects": {
            "motivation": -10,
            "performance": -5,
            "colleagues": 5,
            "boss": 0
        },
        "yesText": "Fikrimi savunacağım",
        "noText": "Uzlaşma yoluna gideceğim",
        "yesFollowups": [
            {
                "id": "PROVEN_RIGHT",
                "text": "Birkaç gün önceki toplantıda fikrinizi ısrarla savunmanız işe yaradı. Bakış açınızın doğru olduğu kanıtlandı ve bu durum teknik uzmanlığınıza olan güveni artırdı.",
                "effects": {
                    "motivation": 20,
                    "performance": 15,
                    "colleagues": 5,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 50
            },
            {
                "id": "DAMAGED_RELATIONSHIP",
                "text": "Fikirlerinizi güçlü savunmanız meslektaşınızla aranızda sürtüşmeye yol açtı ve iş ilişkiniz zarar gördü.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -15,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            }
        ],
        "noFollowups": [
            {
                "id": "BETTER_SOLUTION",
                "text": "Uzlaşma çabalarınız sayesinde iki fikri birleştiren daha iyi bir çözüm ortaya çıktı.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "MISSED_OPPORTUNITY",
                "text": "Dört gün önceki toplantıda fikirlerinizi savunmayıp uzlaşma yoluna gittiğiniz için haklı olduğunuz bir konuda geri adım attınız ve sonuçlar tatmin edici olmadı.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 40
            }
        ]
    },
    {
        "id": "INFO_SYSTEM_OUTAGE",
        "text": "Kurumun ana sistemleri bir siber saldırı sonucu çöktü. BT ekibi sorunu çözmeye çalışıyor. Bugün normal iş akışı ciddi şekilde etkilenecek.",
        "effects": {
            "motivation": -10,
            "performance": -20,
            "colleagues": 5,
            "boss": 0
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_UNEXPECTED_BONUS",
        "text": "Projelerdeki başarınız nedeniyle beklenmedik bir prim ödemesi aldınız! Bu güzel sürpriz motivasyonunuzu artırdı.",
        "effects": {
            "motivation": 25,
            "performance": 10,
            "colleagues": 0,
            "boss": 10
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_OFFICE_RENOVATION",
        "text": "Ofis binasında tadilat başladı. Önümüzdeki hafta boyunca gürültü ve toz nedeniyle çalışma ortamı etkilenecek.",
        "effects": {
            "motivation": -15,
            "performance": -10,
            "colleagues": 0,
            "boss": 0
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_INDUSTRY_AWARD",
        "text": "Kurumunuz sektördeki prestijli bir ödülü kazandı! Herkes gurur duyuyor ve motivasyon yükseldi.",
        "effects": {
            "motivation": 15,
            "performance": 5,
            "colleagues": 10,
            "boss": 5
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_WEATHER_DISRUPTION",
        "text": "Şiddetli bir kar fırtınası nedeniyle ulaşım aksadı. Çoğu çalışan evden çalışıyor veya geç geliyor. Günlük plan değişikliği gerekiyor.",
        "effects": {
            "motivation": -5,
            "performance": -15,
            "colleagues": 5,
            "boss": 0
        },
        "isInfoOnly": true
    },
    {
        "id": "LEADERSHIP_FEEDBACK",
        "text": "Üst yönetim bir projede sergilediğiniz liderliği takdir etti ve daha fazla sorumluluk almanızı istiyor. Yeni görevleri kabul eder misiniz?",
        "yesEffects": {
            "motivation": 15,
            "performance": -5,
            "colleagues": 10,
            "boss": 20
        },
        "noEffects": {
            "motivation": -10,
            "performance": 10,
            "colleagues": -5,
            "boss": -15
        },
        "yesText": "Yeni sorumluluğu kabul et",
        "noText": "Şu an için mevcut rolünde kal",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "LEADERSHIP_SUCCESS",
                "text": "On gün önce, üst yönetimin teklif ettiği yeni sorumlulukları kabul etmiştiniz. Yeni sorumluluklarınız altında başarıyla çalıştınız ve kariyerinizde bir sonraki adım için kendinizi kanıtladınız.",
                "effects": {
                    "motivation": 20,
                    "performance": 15,
                    "colleagues": 15,
                    "boss": 25
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 65
            },
            {
                "id": "OVERWHELMED_LEADER",
                "text": "Bir hafta önce, üst yönetimin teklif ettiği yeni sorumlulukları kabul etmiştiniz. Ancak yeni sorumluluklarınız beklediğinizden çok daha zordu ve kendinizi aşırı yüklenmiş hissediyorsunuz.",
                "effects": {
                    "motivation": -15,
                    "performance": -20,
                    "colleagues": -5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "CAREER_STAGNATION",
                "text": "On beş gün önce, üst yönetimin teklif ettiği yeni sorumlulukları reddedip mevcut rolünüzde kalmayı seçmiştiniz. Bu kararınız kariyer ilerleyişinizi yavaşlattı ve gelecekteki fırsatlar için göz ardı edildiniz.",
                "effects": {
                    "motivation": -20,
                    "performance": -5,
                    "colleagues": 0,
                    "boss": -20
                },
                "isInfoOnly": true,
                "delay": 15,
                "probability": 70
            },
            {
                "id": "WORK_LIFE_BALANCE",
                "text": "On gün önce, üst yönetimin teklif ettiği ek sorumlulukları reddedip mevcut rolünüzde kalmayı seçmiştiniz. Bu kararınız sayesinde iş-yaşam dengenizi koruyabildiniz ve mevcut görevlerinizde mükemmelleştiniz.",
                "effects": {
                    "motivation": 15,
                    "performance": 20,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 30
            }
        ]
    },
    {
        "id": "ETHICS_DILEMMA",
        "text": "Bir iş sürecinde etik açıdan gri bir alan fark ettiniz. Bu durumu rapor etmeniz ilerlemeyi yavaşlatabilir. Ne yaparsınız?",
        "yesEffects": {
            "motivation": 5,
            "performance": -15,
            "colleagues": -10,
            "boss": -5
        },
        "noEffects": {
            "motivation": -15,
            "performance": 10,
            "colleagues": 5,
            "boss": 10
        },
        "yesText": "Etik endişelerini dile getir",
        "noText": "Sessiz kal ve devam et",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "ETHICAL_LEADERSHIP",
                "text": "Beş gün önce, etik endişelerinizi dile getirmeyi seçmiştiniz. Bu yaklaşımınız takdir gördü ve süreçte önemli iyileştirmeler yapıldı. Dürüstlüğünüz saygı uyandırdı.",
                "effects": {
                    "motivation": 20,
                    "performance": 5,
                    "colleagues": 10,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 55
            },
            {
                "id": "WHISTLEBLOWER_BACKLASH",
                "text": "Üç gün önce, etik endişelerinizi dile getirmeyi seçmiştiniz. Ancak bu kararınız bazı meslektaşlarınız tarafından 'sorun çıkaran' olarak görülmenize ve dışlanmanıza yol açtı.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -20,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 45
            }
        ],
        "noFollowups": [
            {
                "id": "GUILTY_CONSCIENCE",
                "text": "Dört gün önce, etik açıdan gri bir alan fark ettiğinizde sessiz kalıp devam etmeyi seçmiştiniz. Ancak bu sessiz kalmanız vicdanınızı rahatsız ediyor ve iş motivasyonunuzu olumsuz etkiliyor.",
                "effects": {
                    "motivation": -25,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 60
            },
            {
                "id": "ISSUE_RESOLVES",
                "text": "Sekiz gün önce, etik açıdan gri bir alan fark ettiğinizde sessiz kalıp devam etmeyi seçmiştiniz. Endişelendiğiniz etik sorun süreç ilerledikçe kendiliğinden çözüldü ve müdahale etmemeniz doğru bir karar oldu.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 8,
                "probability": 40
            }
        ]
    },
    {
        "id": "INNOVATION_SUGGESTION",
        "text": "Uzun süredir kurumumuzda kullanılan bir sürecin iyileştirilebileceğini düşünüyorsunuz. Yenilikçi bir fikriniz var ancak bu fikir mevcut iş yapış şeklini değiştirecek. Bu yeni fikri grup liderinize sunmak ister misiniz?",
        "yesEffects": {
            "motivation": 15,
            "performance": 5,
            "colleagues": -5,
            "boss": 10
        },
        "noEffects": {
            "motivation": -10,
            "performance": -5,
            "colleagues": 0,
            "boss": -5
        },
        "yesText": "Fikrimi paylaşacağım",
        "noText": "Şimdilik bekleteyim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "IDEA_ACCEPTED",
                "text": "Kurumunuzda uzun süredir kullanılan bir süreci iyileştirmek için grup liderinize sunduğunuz yenilikçi fikir büyük ilgi gördü! Grup lideri fikrinizi üst yönetime sunacağını ve sizi de bu sürece dahil edeceğini söyledi.",
                "effects": {
                    "motivation": 10,
                    "performance": 10,
                    "colleagues": 10,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 30
            },
            {
                "id": "PARTIAL_INTEREST",
                "text": "Kurumunuzdaki mevcut iş yapış şeklini değiştirecek yenilikçi fikrinizi paylaştığınızda, grup lideri bunu ilginç buldu ancak uygulamanın zorluklarından bahsetti. Daha önce sunduğunuz fikri daha detaylandırmanızı istedi.",
                "effects": {
                    "motivation": 5,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 45
            },
            {
                "id": "RESISTANCE_TO_CHANGE",
                "text": "Mevcut iş sürecini değiştirmek için grup liderinize sunduğunuz yenilikçi öneri, bazı meslektaşlarınız tarafından direnç gördü. Yerleşik sistemin değişmesini istemiyorlar ve iş yapış şeklini değiştirmeye çalıştığınız için sizi 'sorun çıkaran kişi' olarak görmeye başladılar.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -15,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 25
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_INNOVATION",
                "text": "Kurumunuzdaki iş sürecini iyileştirecek yenilikçi fikrinizi grup liderinizle paylaşmamıştınız. Birkaç hafta sonra başka bir çalışan sizin düşündüğünüze benzer bir öneri sundu ve büyük takdir topladı. Fikrinizi paylaşmadığınız için içinizde bir pişmanlık hissediyorsunuz.",
                "effects": {
                    "motivation": -20,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 65
            },
            {
                "id": "REFINED_IDEA",
                "text": "Kurumunuzdaki iş yapış şeklini değiştirecek fikrinizi grup liderinizle hemen paylaşmak yerine beklediniz. Bu sürede fikrinizi daha da geliştirdiniz ve daha kapsamlı hale getirdiniz. Şimdi, daha önce grup liderinizle paylaşmadığınız bu geliştirilmiş fikri sunmak için daha iyi bir zamanı bekliyorsunuz.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 35
            }
        ]
    },
    {
        "id": "INNOVATION_PROJECT",
        "text": "Kurumunuzda yenilikçi fikirlerin geliştirilmesi için bir 'hackathon' etkinliği düzenleniyor. Kafanızdaki bir fikri geliştirmek için normal iş saatleri dışında çalışmanız gerekecek. Katılmak ister misiniz?",
        "yesEffects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 10,
            "boss": 15
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": -5,
            "boss": -10
        },
        "yesText": "Hackathon'a katılacağım",
        "noText": "Bu etkinliği geçeceğim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "WINNING_IDEA",
                "text": "Geliştirdiğiniz fikir büyük ilgi gördü ve hackathon'da birincilik kazandınız! Fikrinizin kurum içinde uygulanması için bir proje başlatılacak.",
                "effects": {
                    "motivation": 15,
                    "performance": 15,
                    "colleagues": 10,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 25
            },
            {
                "id": "VALUABLE_EXPERIENCE",
                "text": "Fikriniz birinci olmasa da, hackathon sürecinde yeni beceriler kazandınız ve kurum içinde yeni insanlarla tanıştınız.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 55
            },
            {
                "id": "EXHAUSTION_OUTCOME",
                "text": "Hackathon'a katılmak için fazla mesai yaptınız ve bu sizi çok yordu. Sonuçta fikriniz ilgi görmedi ve motivasyonunuz düştü.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": 5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 20
            }
        ],
        "noFollowups": [
            {
                "id": "REST_BENEFIT",
                "text": "Hackathon'a katılmayarak iş-yaşam dengenizi korudunuz ve kendinize zaman ayırdınız. Bu dinlenme size iyi geldi.",
                "effects": {
                    "motivation": 5,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 40
            },
            {
                "id": "MISSED_RECOGNITION",
                "text": "Hackathon'da ilgi çekici fikirler ortaya çıktı ve katılanlar üst yönetimin dikkatini çekti. Bir terfi fırsatını kaçırdığınız hissine kapıldınız.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 60
            }
        ]
    },
    {
        "id": "SALARY_COMPARISON",
        "text": "Bir iş arkadaşınız sizinle aynı pozisyonda çalışıyor ama sizden daha yüksek maaş aldığını öğrendiniz. Bu konuda ne yapmak istersiniz?",
        "yesEffects": {
            "motivation": 10,
            "performance": 0,
            "colleagues": -5,
            "boss": -10
        },
        "noEffects": {
            "motivation": -15,
            "performance": -10,
            "colleagues": 0,
            "boss": 5
        },
        "yesText": "Grup liderimle konuşacağım",
        "noText": "Şimdilik bir şey yapmayacağım",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "POSITIVE_OUTCOME",
                "text": "Grup lideriniz durumu anlayışla karşıladı ve maaşınızın gözden geçirileceğini, potansiyel bir artış için değerlendirileceğini belirtti.",
                "effects": {
                    "motivation": 20,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 30
            },
            {
                "id": "NEUTRAL_EXPLANATION",
                "text": "Grup lideriniz maaş farklılığının deneyim, performans ve işe alım zamanlaması gibi faktörlerden kaynaklandığını açıkladı.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            },
            {
                "id": "NEGATIVE_REACTION",
                "text": "Grup lideriniz maaş bilgilerinin gizli olması gerektiğini belirterek rahatsız oldu ve konuyu kapatmaya çalıştı.",
                "effects": {
                    "motivation": -25,
                    "performance": -15,
                    "colleagues": 0,
                    "boss": -20
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 20
            }
        ],
        "noFollowups": [
            {
                "id": "GROWING_RESENTMENT",
                "text": "Maaş farkı hakkında konuşmadıkça içinizdeki huzursuzluk büyüdü ve bu durum motivasyonunuzu ve performansınızı olumsuz etkilemeye başladı.",
                "effects": {
                    "motivation": -20,
                    "performance": -15,
                    "colleagues": -10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 70
            },
            {
                "id": "RESEARCH_OPPORTUNITY",
                "text": "Aynı pozisyonda çalıştığınız arkadaşınızın sizden daha yüksek maaş aldığını öğrendiğinizde sessiz kalmayı seçmiştiniz. Piyasa araştırması yaptınız ve maaşınızın gerçekten de sektör ortalamasının altında olduğunu tespit ettiniz. Şimdi daha iyi bir müzakere pozisyonundasınız.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 30
            }
        ]
    },
    {
        "id": "SALARY_DISCUSSION",
        "text": "Bir iş arkadaşınız sizinle maaşı hakkında konuşmak istiyor ve kendi maaşını paylaşıyor. Siz de kendi maaşınızı paylaşır mısınız?",
        "yesEffects": {
            "motivation": 5,
            "performance": 0,
            "colleagues": 10,
            "boss": -5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 0,
            "colleagues": -15,
            "boss": 5
        },
        "yesText": "Maaşımı paylaşırım",
        "noText": "Maaşımı paylaşmam",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "MUTUAL_SUPPORT",
                "text": "Açık iletişim sayesinde iş arkadaşınızla maaş konusunda dayanışma içine girdiniz ve birlikte daha iyi koşullar için strateji geliştirmeye başladınız.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 20,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 45
            },
            {
                "id": "UNCOMFORTABLE_SITUATION",
                "text": "Maaşınızın arkadaşınızdan daha yüksek olduğu ortaya çıktı ve bu durum aranızda hafif bir gerginlik yarattı.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": -10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            },
            {
                "id": "MANAGEMENT_AWARENESS",
                "text": "Maaş konuşmalarınız yönetimin kulağına gitti ve maaş şeffaflığı konusunda rahatsız oldukları belli oldu.",
                "effects": {
                    "motivation": 0,
                    "performance": 0,
                    "colleagues": 5,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 20
            }
        ],
        "noFollowups": [
            {
                "id": "COLLEAGUE_DISAPPOINTMENT",
                "text": "İş arkadaşınız maaşınızı paylaşmak istemediğiniz için hayal kırıklığına uğradı ve bu durum aranızdaki güveni sarstı.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": -20,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 65
            },
            {
                "id": "PROFESSIONALISM_APPRECIATED",
                "text": "Maaş bilgilerinizi gizli tutmanız yönetim tarafından profesyonel bir yaklaşım olarak değerlendirildi.",
                "effects": {
                    "motivation": 0,
                    "performance": 0,
                    "colleagues": -5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 35
            }
        ]
    },
    {
        "id": "GROCERY_DURING_WORKDAY",
        "text": "Bugün evinizden çalışıyorsunuz ve buzdolabınızın boşaldığını fark ettiniz. Öğle molasında hızlı bir market alışverişi yapmayı düşünüyorsunuz. Bu bir saatten fazla sürebilir. Ne yaparsınız?",
        "yesEffects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 0,
            "boss": -10
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": 0,
            "boss": 5
        },
        "yesText": "Markete git, durumunu 'uzakta' yap",
        "noText": "İş çıkışına kadar bekle",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "EXTENDED_ABSENCE",
                "text": "Market alışverişi beklenenden uzun sürdü ve bir acil durum toplantısı çağrısını kaçırdınız. Grup lideri sizin yokluğunuzu fark etti.",
                "effects": {
                    "motivation": -15,
                    "performance": -15,
                    "colleagues": -5,
                    "boss": -20
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            },
            {
                "id": "QUICK_SHOPPING",
                "text": "Alışverişi hızlıca tamamladınız ve kimse yokluğunuzu fark etmedi. Öğleden sonraki işlerinize daha enerjik başladınız.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            }
        ],
        "noFollowups": [
            {
                "id": "HUNGER_DISTRACTION",
                "text": "Buzdolabınız boş olduğu için düzgün öğle yemeği yiyemediniz ve öğleden sonra açlıktan konsantrasyonunuz bozuldu.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            },
            {
                "id": "APPRECIATION_OF_PROFESSIONALISM",
                "text": "İş çıkışında markete gittiğinizde, grup liderinizle karşılaştınız. İş saatlerinde orada olmadığınızı görünce profesyonelliğinizi takdir etti.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": 0,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 30
            }
        ]
    },
    {
        "id": "GYM_DURING_WORKDAY",
        "text": "Uzaktan çalışmanın esnekliğinden yararlanmak maksatıyla mesai saatlerinde spor salonuna gitmek istiyorsunuz. İki toplantı arasında 1,5 saatlik bir boşluğunuz var. Ne yaparsınız?",
        "yesEffects": {
            "motivation": 15,
            "performance": 0,
            "colleagues": -5,
            "boss": -5
        },
        "noEffects": {
            "motivation": -10,
            "performance": 5,
            "colleagues": 0,
            "boss": 5
        },
        "yesText": "Spor salonuna git",
        "noText": "İş saatleri içinde gitme",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "ENERGY_BOOST",
                "text": "Egzersiz seansı enerjinizi artırdı ve öğleden sonraki işlerinize daha odaklanmış ve verimli başladınız.",
                "effects": {
                    "motivation": 15,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 65
            },
            {
                "id": "LATE_RETURN",
                "text": "Spor salonunda fazla kaldınız ve sonraki toplantıya geç katıldınız. Herkes sizin nerede olduğunuzu merak ediyordu.",
                "effects": {
                    "motivation": -5,
                    "performance": -10,
                    "colleagues": -10,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "AFTER_HOURS_GYM",
                "text": "İş çıkışı spor salonuna gittiniz ama yorgun olduğunuz için verimli bir antrenman yapamadınız.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 65
            },
            {
                "id": "PRODUCTIVE_BREAK",
                "text": "Spor yerine boş zamanınızı bir sonraki toplantıya hazırlanmak için kullandınız ve etkileyici bir sunum hazırladınız.",
                "effects": {
                    "motivation": 5,
                    "performance": 15,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            }
        ]
    },
    {
        "id": "PACKAGE_DELIVERY",
        "text": "Uzaktan çalıştığınız bir günde önemli bir kuryenin öğleden önce evinize geleceği bilgisi verildi, ancak tam o saatte kritik bir toplantınız var. Ne yaparsınız?",
        "yesEffects": {
            "motivation": 5,
            "performance": -10,
            "colleagues": -5,
            "boss": -10
        },
        "noEffects": {
            "motivation": -5,
            "performance": 10,
            "colleagues": 5,
            "boss": 10
        },
        "yesText": "Toplantıda mikrofonu sessize al ve paketi al",
        "noText": "Teslimatı başka güne ertele",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "SEAMLESS_DELIVERY",
                "text": "Kapıyı açıp paketi aldınız ve hızlıca toplantıya geri döndünüz. Kimse yokluğunuzu fark etmedi.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            },
            {
                "id": "EMBARRASSING_MOMENT",
                "text": "Paketi almaya gittiğinizde mikrofon açık kaldı ve arka plandaki konuşmalar tüm katılımcılara duyuldu.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -10,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            }
        ],
        "noFollowups": [
            {
                "id": "RESCHEDULING_HASSLE",
                "text": "Teslimatı ertelemeye çalıştığınızda, önemli bir evrak içerdiğini ve ertelemenin mümkün olmadığını öğrendiniz. Şimdi endişelisiniz.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            },
            {
                "id": "MEETING_FOCUS",
                "text": "Toplantıya tam konsantre oldunuz ve değerli katkılar sağladınız. Grup lideri performansınızı fark etti.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 5,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            }
        ]
    },
    {
        "id": "LAUNDRY_DURING_CALL",
        "text": "Sessiz bir konferans çağrısı sırasında, çamaşır makinesindeki yıkama programı bitti ve sesleri duyulabilir. Çamaşırları şimdi asmaya gider misiniz?",
        "yesEffects": {
            "motivation": 5,
            "performance": -5,
            "colleagues": -5,
            "boss": -5
        },
        "noEffects": {
            "motivation": 0,
            "performance": 5,
            "colleagues": 0,
            "boss": 5
        },
        "yesText": "Mikrofonu kapat ve çamaşırları as",
        "noText": "Çağrı bitene kadar bekle",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "MULTITASKING_SUCCESS",
                "text": "Çamaşırları asarken çağrıyı kulaklıktan dinlemeye devam ettiniz ve önemli bir konuyu kaçırmadınız.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            },
            {
                "id": "MISSED_QUESTION",
                "text": "Çamaşırlarla uğraşırken size sorulan bir soruyu duymadınız ve garip bir sessizlik oluştu.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": -5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            }
        ],
        "noFollowups": [
            {
                "id": "PROFESSIONAL_FOCUS",
                "text": "Toplantıya tam odaklandınız ve değerli yorumlar yaptınız. Profesyonelliğiniz dikkat çekti.",
                "effects": {
                    "motivation": 5,
                    "performance": 10,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "WRINKLED_CLOTHES",
                "text": "Çamaşırları uzun süre makinede bıraktığınız için kırıştılar ve tekrar yıkamanız gerekti.",
                "effects": {
                    "motivation": -10,
                    "performance": 0,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            }
        ]
    },
    {
        "id": "LUNCH_PREPARATION",
        "text": "Öğle molasında masanızsa oturup uzun zamandır izlemek istediğiniz videoyu izlemek istiyorsunuz. Arkadaşlarınız kahve içerken sohbet ettiklerini görüyorsunuz. Ne yaparsınız?",
        "yesEffects": {
            "motivation": 10,
            "performance": 5,
            "colleagues": -10,
            "boss": 0
        },
        "noEffects": {
            "motivation": -5,
            "performance": 0,
            "colleagues": 10,
            "boss": 5
        },
        "yesText": "Videoyu izlemeyi tercih ederim",
        "noText": "Kahve içip sohbet ederim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "VIDEO_INSPIRATION",
                "text": "İzlediğiniz video işinizle ilgili yeni fikirler verdi ve öğleden sonra daha verimli çalıştınız.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            },
            {
                "id": "MISSED_INFORMATION",
                "text": "Kahve sohbetinde yeni bir proje hakkında önemli bilgiler paylaşıldı ve siz bunu kaçırdınız.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": -5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            }
        ],
        "noFollowups": [
            {
                "id": "TEAM_BONDING",
                "text": "Kahve sohbeti çok keyifli geçti ve iş arkadaşlarınızla daha yakın bağlar kurdunuz.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 75
            },
            {
                "id": "TIRED_AFTERNOON",
                "text": "Uzun kahve molası sonrası işe dönmekte zorlandınız ve dikkatiniz dağıldı.",
                "effects": {
                    "motivation": -10,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 25
            }
        ]
    },
    {
        "id": "DOCTOR_APPOINTMENT",
        "text": "Uzaktan çalıştığınız bir günde aynı zamanda öğleden sonra için kısa bir doktor randevunuz var. Takvimde görünür şekilde işaretleyip izin ister misiniz yoksa sessizce halletmeye mi çalışırsınız?",
        "yesEffects": {
            "motivation": 5,
            "performance": 0,
            "colleagues": 0,
            "boss": 10
        },
        "noEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": 0,
            "boss": -15
        },
        "yesText": "Takvime işaretle ve bildir",
        "noText": "Sessizce hallederim",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "OPEN_COMMUNICATION",
                "text": "Şeffaflığınız takdir edildi ve randevunuz için size rahatlıkla izin verildi.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 80
            },
            {
                "id": "SCHEDULE_CHANGE",
                "text": "Doktor randevunuz nedeniyle önemli bir toplantı özellikle sizin için yeniden planlandı ve bu bazı iş arkadaşlarınızın programını bozdu.",
                "effects": {
                    "motivation": 0,
                    "performance": 0,
                    "colleagues": -10,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 20
            }
        ],
        "noFollowups": [
            {
                "id": "UNEXPECTED_CALL",
                "text": "Doktordayken grup lideriniz acil bir durumla ilgili sizi aradı ve ulaşamadı. Döndüğünüzde açıklama yapmanız gerekti.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": 0,
                    "boss": -20
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 65
            },
            {
                "id": "SUCCESSFUL_BALANCE",
                "text": "Randevunuzu kimseyi rahatsız etmeden hallettiniz ve işlerinizi aksatmadan tamamladınız.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            }
        ]
    },
    {
        "id": "HOME_REPAIR",
        "text": "Bugün evinizden çalışıyorsunuz ve su tesisatınızda bir sorun oluştu ve tamirci çağırmanız gerekiyor. Bu durumu ekibinize bildirir misiniz?",
        "yesEffects": {
            "motivation": 5,
            "performance": -5,
            "colleagues": 5,
            "boss": 5
        },
        "noEffects": {
            "motivation": -10,
            "performance": -15,
            "colleagues": 0,
            "boss": -5
        },
        "yesText": "Durumu bildir ve izin iste",
        "noText": "Toplantılar arasında halletmeye çalış",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "UNDERSTANDING_TEAM",
                "text": "Ekibiniz durumu anlayışla karşıladı ve acil sorunla ilgilenmeniz için size zaman tanıdı.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 10,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 75
            },
            {
                "id": "EXCESSIVE_ABSENCE",
                "text": "Tamir beklenenden uzun sürdü ve o gün için neredeyse tüm çalışma saatlerinizi kaybettiniz.",
                "effects": {
                    "motivation": -5,
                    "performance": -20,
                    "colleagues": -5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 25
            }
        ],
        "noFollowups": [
            {
                "id": "GROWING_PROBLEM",
                "text": "Sorunu hemen halledemediğiniz için tesisat sorunu büyüdü ve evinize ciddi zarar verdi.",
                "effects": {
                    "motivation": -20,
                    "performance": -15,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "QUICK_FIX",
                "text": "Şanslısınız, tamirci hızlıca gelip sorunu çözdü ve siz de işinize kolayca geri dönebildiniz.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            }
        ]
    },
    {
        "id": "CHILD_CARE_EMERGENCY",
        "text": "Bugün ofise gitmediniz, uzaktan çalışıyorsunuz ve çocuğunuzun okulundan aradılar. Acilen gelip çocuğunuzu almanızı istediler. Önemli bir toplantıdasınız. Ne yaparsınız?",
        "yesEffects": {
            "motivation": 5,
            "performance": -10,
            "colleagues": 0,
            "boss": -5
        },
        "noEffects": {
            "motivation": -20,
            "performance": 5,
            "colleagues": 0,
            "boss": 10
        },
        "yesText": "Toplantıyı bırak ve çocuğunu al",
        "noText": "Başka birinden yardım iste",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "SUPPORTIVE_WORKPLACE",
                "text": "Durumu açıkladığınızda ekibiniz çok anlayışlı davrandı ve toplantıyı başka bir güne erteledi.",
                "effects": {
                    "motivation": 20,
                    "performance": 5,
                    "colleagues": 10,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 65
            },
            {
                "id": "MISSED_OPPORTUNITY",
                "text": "Toplantıda önemli bir karar alındı ve sizin yokluğunuzda projenizin önceliği düşürüldü.",
                "effects": {
                    "motivation": -15,
                    "performance": -15,
                    "colleagues": -5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "FAMILY_STRAIN",
                "text": "Başka birini ayarladınız ama çocuğunuz sizin gelmemenize üzüldü. Aile dengesini korumakta zorlanıyorsunuz.",
                "effects": {
                    "motivation": -25,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 75
            },
            {
                "id": "SUCCESSFUL_DELEGATION",
                "text": "Eşiniz durumu halletti ve siz de toplantıda önemli bir katkı sağladınız.",
                "effects": {
                    "motivation": 5,
                    "performance": 15,
                    "colleagues": 5,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 25
            }
        ]
    },
    {
        "id": "REMOTE_WORK_TECHNICAL_ISSUE",
        "text": "Evden çalışırken internet bağlantınızda sorun yaşıyorsunuz ve önemli bir toplantı yaklaşıyor. Bu durumu hemen bildirir misiniz yoksa son ana kadar çözmeye mi çalışırsınız?",
        "yesEffects": {
            "motivation": 0,
            "performance": -5,
            "colleagues": 5,
            "boss": 10
        },
        "noEffects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": -5,
            "boss": -5
        },
        "yesText": "Hemen bildir",
        "noText": "Çözmeye çalış",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "PROACTIVE_APPRECIATION",
                "text": "Sorunu önceden bildirdiğiniz için ekip toplantıyı erteledi ve proaktif yaklaşımınız takdir edildi.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 10,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 80
            },
            {
                "id": "UNNECESSARY_CONCERN",
                "text": "Sorunu bildirdiniz ama toplantıdan önce düzeldi. Bazıları erken bildiriminizi gereksiz endişe olarak yorumladı.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 20
            }
        ],
        "noFollowups": [
            {
                "id": "LAST_MINUTE_FIX",
                "text": "Sorunu son anda çözmeyi başardınız ve toplantıya katıldınız. Kimse sorunun farkına varmadı.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            },
            {
                "id": "MISSED_MEETING",
                "text": "Sorunu çözemediniz ve toplantıyı kaçırdınız. Bu durum önemli tartışmaları kaçırmanıza neden oldu ve olumsuz izlenim bıraktı.",
                "effects": {
                    "motivation": -15,
                    "performance": -15,
                    "colleagues": -5,
                    "boss": -20
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            }
        ]
    },
    {
        "id": "ONLINE_STATUS_DILEMMA",
        "text": "Bugün evden çalışıyorsunuz ve evinizdeki bir durumla ilgilenmeniz gerekiyor ama toplantınız henüz bitmedi. Durumunuzu 'Meşgul' olarak ayarlar mısınız yoksa çevrimiçi kalıp toplantıda pasif mi kalırsınız?",
        "yesEffects": {
            "motivation": 5,
            "performance": -5,
            "colleagues": -5,
            "boss": -10
        },
        "noEffects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": 5,
            "boss": 5
        },
        "yesText": "Durumu 'Meşgul' olarak ayarla",
        "noText": "Çevrimiçi kal ve toplantıyı dinle",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "MANAGER_NOTICE",
                "text": "Grup lideri durumunuzu 'Meşgul' olarak değiştirdiğinizi fark etti ve toplantı sonrası sizden açıklama istedi.",
                "effects": {
                    "motivation": -10,
                    "performance": 0,
                    "colleagues": 0,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            },
            {
                "id": "EFFECTIVE_MULTITASKING",
                "text": "Durumunuzu 'Meşgul' olarak ayarlayıp durumla ilgilendiniz ve sonra sorunsuz şekilde toplantıya geri döndünüz.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_EMERGENCY",
                "text": "Bir gün önce, evdeki durumla ilgilenmek yerine toplantıda çevrimiçi kalmayı seçmiştiniz. Bu yüzden durumu zamanında çözemediniz ve bu durum daha büyük bir soruna yol açtı.",
                "effects": {
                    "motivation": -15,
                    "performance": -20,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 50
            },
            {
                "id": "RECOGNITION_FOR_PRESENCE",
                "text": "Toplantıda kaldığınız için grup lideri katılımınızı takdir etti ve önemli bir konuda fikrinizi sordu.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            }
        ]
    },
    {
        "id": "OVERTIME_REQUEST",
        "text": "Geliştirdiğiniz ürünün yarın testlerinin yapılması planlanıyor. Nihai testlerden önce ön test işlemi yapılması lazım lakin mesai saatleri içerisinde yetiştirmeniz mümkün değil. Mesaiye kalıp testleri tamamlar mısınız?",
        "requirements": {
            "resource": "performance",
            "comparison": "gte",
            "value": 20
        },
        "yesEffects": {
            "motivation": -10,
            "performance": 15,
            "colleagues": -5,
            "boss": 10
        },
        "noEffects": {
            "motivation": 5,
            "performance": -10,
            "colleagues": 5,
            "boss": -5
        },
        "yesText": "Elbette, kalırım",
        "noText": "Üzgünüm, kalamam",
        "yesFollowups": [],
        "noFollowups": []
    },
    {
        "id": "CONFLICT_WITH_COLLEAGUE",
        "text": "Farklı ekipten biri sizin yaptığınız işin çok da önemli olmadığını kendi ekibinin yaptığı işlerin daha önemli olduğunu söylüyor. Ne yaparsınız?",
        "requirements": {
            "resource": "motivation",
            "comparison": "gt",
            "value": 50
        },
        "yesEffects": {
            "motivation": 0,
            "performance": 0,
            "colleagues": -10,
            "boss": 0
        },
        "noEffects": {
            "motivation": -5,
            "performance": 0,
            "colleagues": -10,
            "boss": 0
        },
        "yesText": "Ona düşüncesinin yanlış olduğunu söylerim",
        "noText": "Duymamış gibi yaparım",
        "yesFollowups": [
            {
                "id": "FEEDBACK_POSITIVE",
                "text": "İş arkadaşınız sizinle aynı fikirde değil ama saygı duyuyor. Bu durum işbirliğinizi etkilemeyecek.",
                "effects": {
                    "motivation": 0,
                    "performance": 0,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            },
            {
                "id": "FEEDBACK_NEGATIVE",
                "text": "İş arkadaşınız sizinle aynı fikirde değil ve aranızda bir tartışma çıktı. Bu durum işbirliğinizi etkileyebilir.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            }
        ]
    },
    {
        "id": "QUESTION_FROM_STRANGER",
        "text": "Pek hoşlanmadığınız bir arkadaşınız soru sormak için yanınıza geldi ve önce elini uzattı. Ne yaparsınız?",
        "yesEffects": {
            "motivation": 0,
            "performance": 0,
            "colleagues": 0,
            "boss": 0
        },
        "noEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": 0,
            "boss": -10
        },
        "yesText": "Elini sıkıveririm",
        "noText": "Elini sıkmam",
        "maxUses": 3,
        "noFollowups": [
            {
                "id": "FEEDBACK_NEGATIVE",
                "text": "Arkadaşınız alındı ama yine de sorusunu sordu. Uzun bir konuşma oldu ve işlerinizi aksattı.",
                "effects": {
                    "motivation": -10,
                    "performance": -10,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            },
            {
                "id": "FEEDBACK_NEGATIVE",
                "text": "Arkadaşınız alındı ve sorusunu sormaktan vazgeçti.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": -10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            },
            {
                "id": "FEEDBACK_NEGATIVE",
                "text": "Arkadaşınız alındı ama yine de sorusunu sordu. Neyse ki kısa bir konuşma oldu.",
                "effects": {
                    "motivation": 0,
                    "performance": 0,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            }
        ]
    },
    {
        "id": "OVERTIME_MESSAGE",
        "text": "Mesai sonrası bir mesaj geldiğini görüyorsunuz. Mesajı okur musunuz?",
        "requirements": {
            "resource": "performance",
            "comparison": "gte",
            "value": 20
        },
        "yesEffects": {
            "motivation": -10,
            "performance": 15,
            "colleagues": -5,
            "boss": 10
        },
        "noEffects": {
            "motivation": 5,
            "performance": -10,
            "colleagues": 5,
            "boss": -5
        },
        "yesText": "Evet, okurum",
        "noText": "Hayır, okumam",
        "yesFollowups": [
            {
                "id": "URGENT_PROJECT_REQUEST",
                "text": "Mesaj proje sorumlusundan! Yarın yapılacak kabül öncesi bir sorun fark edilmiş ve yardımınızı istiyor. Geç saate rağmen yardım eder misiniz?",
                "yesEffects": {
                    "motivation": -15,
                    "performance": 20,
                    "colleagues": 0,
                    "boss": 25
                },
                "noEffects": {
                    "motivation": 10,
                    "performance": -5,
                    "colleagues": 0,
                    "boss": -20
                },
                "yesText": "Evet, yardım ederim",
                "noText": "Üzgünüm, yapamam",
                "delay": 0,
                "probability": 40,
                "yesFollowups": [
                    {
                        "id": "PROJECT_SUCCESS",
                        "text": "İki gün önce, proje sorumlusunun acil yardım talebine geç saate rağmen 'Evet, yardım ederim' demiştiniz. Geç saatlere kadar çalıştınız ve projeyi tamamladınız. Proje sorumlusu çok memnun ve takdir ediyor!",
                        "effects": {
                            "motivation": -5,
                            "performance": 15,
                            "colleagues": 10,
                            "boss": 20
                        },
                        "isInfoOnly": true,
                        "delay": 2,
                        "probability": 80
                    },
                    {
                        "id": "PROJECT_EXHAUSTION",
                        "text": "İki gün önce, proje sorumlusunun acil yardım talebine geç saate rağmen 'Evet, yardım ederim' demiştiniz. Projeyi tamamladınız ama gece boyunca çalışmak sizi bitkin düşürdü. Bugün kendinizi yorgun hissediyorsunuz.",
                        "effects": {
                            "motivation": -20,
                            "performance": -10,
                            "colleagues": 0,
                            "boss": 5
                        },
                        "isInfoOnly": true,
                        "delay": 2,
                        "probability": 20
                    }
                ]
            },
            {
                "id": "COLLEAGUE_GOSSIP",
                "text": "Mesaj bir iş arkadaşınızdan! Size ofisteki son dedikodular hakkında bilgi veriyor. Sohbete devam eder misiniz?",
                "yesEffects": {
                    "motivation": 10,
                    "performance": -5,
                    "colleagues": 15,
                    "boss": -5
                },
                "noEffects": {
                    "motivation": 0,
                    "performance": 5,
                    "colleagues": -10,
                    "boss": 0
                },
                "yesText": "Evet, devam edelim",
                "noText": "Şimdi olmaz",
                "delay": 0,
                "probability": 35,
                "yesFollowups": [
                    {
                        "id": "GOSSIP_BACKFIRED",
                        "text": "Üç gün önce, iş arkadaşınızın dedikodu sohbetine 'Evet, devam edelim' diyerek katılmıştınız. Dedikodunun yayıldığı ve bazı iş arkadaşlarınızı rahatsız ettiği ortaya çıktı.",
                        "effects": {
                            "motivation": -5,
                            "performance": 0,
                            "colleagues": -15,
                            "boss": -10
                        },
                        "isInfoOnly": true,
                        "delay": 3,
                        "probability": 40
                    },
                    {
                        "id": "GOSSIP_INSIDER",
                        "text": "Üç gün önce, iş arkadaşınızın dedikodu sohbetine 'Evet, devam edelim' diyerek katılmıştınız. İş arkadaşınızla kurduğunuz yakınlık sayesinde önemli bir şirket değişikliğini önceden öğrendiniz ve hazırlıklı oldunuz.",
                        "effects": {
                            "motivation": 10,
                            "performance": 15,
                            "colleagues": 5,
                            "boss": 5
                        },
                        "isInfoOnly": true,
                        "delay": 3,
                        "probability": 60
                    }
                ]
            },
            {
                "id": "SYSTEM_NOTIFICATION",
                "text": "Mesaj sadece bir bildirim! Sabah attığınız mesaja arkadaşınız emoji atmış.",
                "effects": {
                    "motivation": 0,
                    "performance": 0,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 25
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_IMPORTANT_INFO",
                "text": "İki gün önce, mesai sonrası gelen mesajı okumamayı seçmiştiniz. Meğer o mesaj yarın yapılacak önemli bir toplantı hakkındaymış ve siz hazırlıksız yakalandınız.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": 0,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 60
            },
            {
                "id": "WORK_LIFE_BALANCE",
                "text": "Mesai sonrası zamanınızı ailenizle/kendinizle geçirdiniz ve bu sizi mutlu etti.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            }
        ]
    },
    {
        "id": "COLLEAGUE_CALL",
        "text": "Öğle molasında telefonunuz çalıyor. Arayan, yakın çalışmadığınız bir iş arkadaşı. Telefonu açar mısınız?",
        "requirements": {
            "resource": "colleagues",
            "comparison": "gte",
            "value": 25
        },
        "yesEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": 10,
            "boss": 0
        },
        "noEffects": {
            "motivation": 5,
            "performance": 5,
            "colleagues": -10,
            "boss": 0
        },
        "yesText": "Evet, açarım",
        "noText": "Hayır, açmam",
        "yesFollowups": [
            {
                "id": "HELP_WITH_PRESENTATION",
                "text": "Arayan arkadaşınız yarın yapacağı önemli sunum için panik içinde ve sizden yardım istiyor. Öğle molanızı feda eder misiniz?",
                "yesEffects": {
                    "motivation": -10,
                    "performance": -10,
                    "colleagues": 20,
                    "boss": 5
                },
                "noEffects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": -15,
                    "boss": 0
                },
                "yesText": "Evet, yardım ederim",
                "noText": "Üzgünüm, molamı kullanmalıyım",
                "delay": 0,
                "probability": 45,
                "yesFollowups": [
                    {
                        "id": "PRESENTATION_SUCCESS",
                        "text": "İki gün önce, öğle molanızda arayan arkadaşınıza sunumu için yardım etmeyi kabul etmiştiniz. Yardımınız sayesinde sunumu mükemmel geçti ve size olan minnettarlığını tüm ofiste dile getiriyor.",
                        "effects": {
                            "motivation": 15,
                            "performance": 5,
                            "colleagues": 15,
                            "boss": 10
                        },
                        "isInfoOnly": true,
                        "delay": 2,
                        "probability": 70
                    },
                    {
                        "id": "NO_RECOGNITION",
                        "text": "İki gün önce, öğle molanızda arayan arkadaşınıza sunumu için yardım etmeyi kabul etmiştiniz. Arkadaşınız sunumda başarılı oldu ama katkınızdan hiç bahsetmedi. Biraz hayal kırıklığına uğradınız.",
                        "effects": {
                            "motivation": -10,
                            "performance": 0,
                            "colleagues": -5,
                            "boss": 0
                        },
                        "isInfoOnly": true,
                        "delay": 2,
                        "probability": 30
                    }
                ]
            },
            {
                "id": "PERSONAL_CRISIS",
                "text": "Arayan arkadaşınız kişisel bir kriz yaşıyor ve sadece konuşmaya ihtiyacı var. Ona zaman ayırır mısınız?",
                "yesEffects": {
                    "motivation": 5,
                    "performance": -5,
                    "colleagues": 15,
                    "boss": -5
                },
                "noEffects": {
                    "motivation": 0,
                    "performance": 5,
                    "colleagues": -20,
                    "boss": 0
                },
                "yesText": "Evet, dinlerim",
                "noText": "Şu anda müsait değilim",
                "delay": 0,
                "probability": 30,
                "yesFollowups": [
                    {
                        "id": "DEEP_FRIENDSHIP",
                        "text": "Dört gün önce, öğle molanızda arayan ve kişisel bir kriz yaşayan arkadaşınızı dinlemeyi seçmiştiniz. Bu derin sohbet sonrası aranızda güçlü bir dostluk bağı oluştu.",
                        "effects": {
                            "motivation": 15,
                            "performance": 5,
                            "colleagues": 10,
                            "boss": 0
                        },
                        "isInfoOnly": true,
                        "delay": 4,
                        "probability": 75
                    },
                    {
                        "id": "EMOTIONAL_DRAIN",
                        "text": "İki gün önce, öğle molanızda arayan ve kişisel bir kriz yaşayan arkadaşınızı dinlemeyi seçmiştiniz. Ancak sorunları beklenenden daha karmaşıktı ve konuşma sizi duygusal olarak tüketti.",
                        "effects": {
                            "motivation": -15,
                            "performance": -5,
                            "colleagues": 5,
                            "boss": 0
                        },
                        "isInfoOnly": true,
                        "delay": 2,
                        "probability": 25
                    }
                ]
            },
            {
                "id": "LUNCH_INVITATION",
                "text": "İş arkadaşınız sadece öğle yemeğini beraber yemek için sizi aramış. Kabul eder misiniz?",
                "yesEffects": {
                    "motivation": 10,
                    "performance": -5,
                    "colleagues": 10,
                    "boss": 0
                },
                "noEffects": {
                    "motivation": -5,
                    "performance": 5,
                    "colleagues": -10,
                    "boss": 0
                },
                "yesText": "Evet, gidelim",
                "noText": "Bugün başka planım var",
                "delay": 0,
                "probability": 25,
                "yesFollowups": [
                    {
                        "id": "NETWORKING_LUNCH",
                        "text": "Öğle yemeğinde şirketteki diğer bölümlerden insanlarla da tanıştınız. İş ağınız genişledi.",
                        "effects": {
                            "motivation": 5,
                            "performance": 5,
                            "colleagues": 10,
                            "boss": 5
                        },
                        "isInfoOnly": true,
                        "delay": 0,
                        "probability": 50
                    },
                    {
                        "id": "LUNCH_GOSSIP",
                        "text": "Üç gün önce, öğle molanızda arayan arkadaşınızın yemek teklifini kabul etmiştiniz. Öğle yemeğinde ortaya çıkan dedikodular düşündüğünüzden daha hızlı yayıldı ve bazı kişileri rahatsız etti.",
                        "effects": {
                            "motivation": 0,
                            "performance": 0,
                            "colleagues": -10,
                            "boss": -5
                        },
                        "isInfoOnly": true,
                        "delay": 3,
                        "probability": 50
                    }
                ]
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_PROMOTION_INFO",
                "text": "Üç gün önce, öğle molanızda çalan telefonunuzu açmamayı seçmiştiniz. Meğer arayan arkadaşınız daha iyi olduğunu düşündüğü açık pozisyon hakkında size bilgi vermek istemiş. Fırsatı kaçırdınız.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 40
            },
            {
                "id": "PRODUCTIVE_LUNCH",
                "text": "Öğle molanızı rahatsız edilmeden geçirdiniz ve işinize daha konsantre döndünüz.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            },
            {
                "id": "COLLEAGUE_OFFENDED",
                "text": "İki gün önce, öğle molanızda çalan telefonunuzu açmamayı seçmiştiniz. Telefonunu açmadığınız iş arkadaşınız alınmış ve bunu diğer arkadaşlarınıza anlatmış.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": -15,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 20
            }
        ]
    },
    {
        "id": "COLLEAGUE_CALL",
        "text": "Eve geldiniz ve akşam yemeğinizi hazırladığınız sırada telefonunuz çalıyor. Arayan, yakın çalışmadığınız bir iş arkadaşı. Telefonu açar mısınız?",
        "requirements": {
            "resource": "colleagues",
            "comparison": "gte",
            "value": 25
        },
        "yesEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": 10,
            "boss": 0
        },
        "noEffects": {
            "motivation": 5,
            "performance": 5,
            "colleagues": -10,
            "boss": 0
        },
        "yesText": "Evet, açarım",
        "noText": "Hayır, açmam",
        "yesFollowups": [
            {
                "id": "HELP_WITH_PRESENTATION",
                "text": "İş arkadaşınız sistemlerinizden birinin çalışmadığını fark etmiş  ve sizden yardım istiyor. Akşam yemeğinizi feda eder misiniz?",
                "yesEffects": {
                    "motivation": -10,
                    "performance": -10,
                    "colleagues": 20,
                    "boss": 5
                },
                "noEffects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": -15,
                    "boss": 0
                },
                "yesText": "Evet, yardım ederim",
                "noText": "Üzgünüm, yemeğimi hazırlamam lazım",
                "delay": 0,
                "probability": 45,
                "yesFollowups": [
                    {
                        "id": "PRESENTATION_SUCCESS",
                        "text": "İki gün önce, akşam yemeği sırasında arayan arkadaşınıza sistem sorunu için yardım etmeyi kabul etmiştiniz. Yardımlarınız sayesinde sistem yeniden çalışmaya başladı. Arkadaşınız memnun kaldı ve size teşekkür etti.",
                        "effects": {
                            "motivation": 15,
                            "performance": 5,
                            "colleagues": 15,
                            "boss": 10
                        },
                        "isInfoOnly": true,
                        "delay": 2,
                        "probability": 70
                    },
                    {
                        "id": "NO_RECOGNITION",
                        "text": "İki gün önce, akşam yemeği sırasında arayan arkadaşınıza sistem sorunu için yardım etmeyi kabul etmiştiniz. Yardımlarınız sayesinde sistem yeniden çalışmaya başladı ama arkadaşınız teşekkür bile etmedi. Biraz hayal kırıklığına uğradınız.",
                        "effects": {
                            "motivation": -10,
                            "performance": 0,
                            "colleagues": -5,
                            "boss": 0
                        },
                        "isInfoOnly": true,
                        "delay": 2,
                        "probability": 30
                    }
                ]
            },
            {
                "id": "PERSONAL_CRISIS",
                "text": "İş arkadaşınız kişisel bir kriz yaşıyor ve sadece konuşmaya ihtiyacı var. Ona zaman ayırır mısınız?",
                "yesEffects": {
                    "motivation": 5,
                    "performance": -5,
                    "colleagues": 15,
                    "boss": -5
                },
                "noEffects": {
                    "motivation": 0,
                    "performance": 5,
                    "colleagues": -20,
                    "boss": 0
                },
                "yesText": "Evet, dinlerim",
                "noText": "Şu anda müsait değilim",
                "delay": 0,
                "probability": 30,
                "yesFollowups": [
                    {
                        "id": "DEEP_FRIENDSHIP",
                        "text": "Dört gün önce, akşam yemeği sırasında arayan ve kişisel bir kriz yaşayan arkadaşınızı dinlemeyi seçmiştiniz. Bu derin sohbet sonrası aranızda güçlü bir dostluk bağı oluştu.",
                        "effects": {
                            "motivation": 15,
                            "performance": 5,
                            "colleagues": 10,
                            "boss": 0
                        },
                        "isInfoOnly": true,
                        "delay": 4,
                        "probability": 75
                    },
                    {
                        "id": "EMOTIONAL_DRAIN",
                        "text": "İki gün önce, akşam yemeği sırasında arayan ve kişisel bir kriz yaşayan arkadaşınızı dinlemeyi seçmiştiniz. Ancak sorunları beklenenden daha karmaşıktı ve konuşma sizi duygusal olarak tüketti.",
                        "effects": {
                            "motivation": -15,
                            "performance": -5,
                            "colleagues": 5,
                            "boss": 0
                        },
                        "isInfoOnly": true,
                        "delay": 2,
                        "probability": 25
                    }
                ]
            },
            {
                "id": "LUNCH_INVITATION",
                "text": "İş arkadaşınız iki gün sonra teslim edilmesi planlanan rapor ile ilgili soru sormak için aramış. Sorularını cevaplar mısınız?",
                "yesEffects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": 5,
                    "boss": 0
                },
                "noEffects": {
                    "motivation": 0,
                    "performance": 0,
                    "colleagues": -10,
                    "boss": 0
                },
                "yesText": "Evet, cevaplarım",
                "noText": "Şimdi olmaz",
                "delay": 0,
                "probability": 25
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_PROMOTION_INFO",
                "text": "Üç gün önce, akşam yemeği sırasında çalan telefonunuzu açmamayı seçmiştiniz. Meğer arkadaşınız açık pozisyon hakkında size bilgi vermek istiyormuş. Fırsat kaçtı.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 40
            },
            {
                "id": "PRODUCTIVE_LUNCH",
                "text": "Mesai dışı zamanınızı rahatsız edilmeden geçirdiniz ve yemeğinizin tadını çıkardınız.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 40
            },
            {
                "id": "COLLEAGUE_OFFENDED",
                "text": "İki gün önce, akşam yemeği sırasında çalan telefonunuzu açmamayı seçmiştiniz. Telefonunu açmadığınız iş arkadaşınız alınmış ve bunu diğer arkadaşlarınıza anlatmış.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": -15,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 20
            }
        ]
    },
    {
        "id": "OFFICE_PARTY",
        "text": "Aranızdan ayrılacak bir personel için bugün veda etkinliği düzenleneceğini öğrendiniz, katılacak mısınız?",
        "requirements": {
            "resource": "colleagues",
            "comparison": "gte",
            "value": 30
        },
        "yesEffects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 15,
            "boss": 5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": -10,
            "boss": -5
        },
        "yesText": "Evet, harika olur!",
        "noText": "Hayır, başka planlarım var",
        "yesFollowups": [],
        "noFollowups": []
    },
    {
        "id": "OFFICE_DINNER",
        "text": "Grubunuz yarın akşam için akşam yemeği planlamış, görünüşe göre herkes katılacak. Peki ya siz?",
        "requirements": {
            "resource": "colleagues",
            "comparison": "gte",
            "value": 50
        },
        "yesEffects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 15,
            "boss": 5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": -10,
            "boss": -5
        },
        "yesText": "Evet, harika olur!",
        "noText": "Hayır, başka planlarım var",
        "yesFollowups": [],
        "noFollowups": []
    },
    {
        "id": "OFFICE_CINEMA",
        "text": "Arkadaşlarınız hafta sonu sinemaya gitmeyi düşünüyor ve sizi de davet ettiler. Gidecek misiniz?",
        "requirements": {
            "resource": "colleagues",
            "comparison": "gte",
            "value": 70
        },
        "yesEffects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 15,
            "boss": 5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": -10,
            "boss": -5
        },
        "yesText": "Evet, harika olur!",
        "noText": "Hayır, başka planlarım var",
        "yesFollowups": [],
        "noFollowups": []
    },
    {
        "id": "OFFICE_WALKING",
        "text": "Bir grup arkadaşınız öğle yemeğinden sonra yürüyüşe çıkmayı düşünüyor. Katılacak mısınız?",
        "requirements": {
            "resource": "colleagues",
            "comparison": "gte",
            "value": 50
        },
        "yesEffects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 15,
            "boss": 5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": -10,
            "boss": -5
        },
        "yesText": "Evet, harika olur!",
        "noText": "Hayır, başka planlarım var",
        "yesFollowups": [],
        "noFollowups": [
            {
                "id": "FEEDBACK_NEGATIVE",
                "text": "Arkadaşlarınız yürüşe çıktı ama siz katılmadınız. Onlar bu durumu pek hoş karşılamadı.",
                "effects": {
                    "motivation": -10,
                    "performance": 0,
                    "colleagues": -10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 100
            }
        ]
    },
    {
        "id": "CRITICIZE_BOSS",
        "text": "Proje yöneticisinin son toplantıdaki fikrinin kusurlu olduğunu düşünüyorsunuz. Bunu dile getirmek ister misiniz?",
        "requirements": {
            "type": "or",
            "conditions": [
                {
                    "resource": "performance",
                    "comparison": "gte",
                    "value": 60
                },
                {
                    "resource": "boss",
                    "comparison": "lte",
                    "value": 25
                }
            ]
        },
        "yesEffects": {
            "motivation": 5,
            "performance": 0,
            "colleagues": 5,
            "boss": -15
        },
        "noEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": -5,
            "boss": 5
        },
        "yesText": "Fikrimi belirtmeliyim",
        "noText": "Sessiz kalmak en iyisi",
        "yesFollowups": [
            {
                "id": "VINDICATED_ANALYSIS",
                "text": "Beş gün önce, proje yöneticisinin fikrinin kusurlu olduğunu düşündüğünüzde fikrinizi belirtmeyi seçmiştiniz. Eleştiriniz sonradan haklı çıktı. Proje yöneticiniz başlangıçta rahatsız olsa da, açık sözlülüğünüz ve teknik bilginiz için size saygı duymaya başladı.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 10,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 35
            },
            {
                "id": "TEAM_RESPECT",
                "text": "Eleştirinizi dile getirdiğiniz için ekip üyeleri size saygı duydu, ancak proje yöneticiniz sizin yaklaşımınızı pek takdir etmedi ve size daha soğuk davranmaya başladı.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            },
            {
                "id": "PUBLIC_REBUKE",
                "text": "Proje yöneticiniz eleştirinizi toplantıda kişisel saldırı olarak algıladı ve sizi herkesin önünde azarladı. Bu olay sonrası ekip içindeki ortam gergin bir hal aldı.",
                "effects": {
                    "motivation": -20,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": -20
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 20
            },
            {
                "id": "CONSTRUCTIVE_DIALOGUE",
                "text": "Eleştiriniz, proje yöneticinizle yapıcı bir tartışmaya yol açtı. Birlikte orijinal fikri geliştirerek daha iyi bir çözüm buldunuz ve bu işbirliği ikinizi de memnun etti.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 15
            }
        ],
        "noFollowups": [
            {
                "id": "IDEA_FAILS",
                "text": "Bir hafta önce, proje yöneticisinin fikrinin kusurlu olduğunu düşündüğünüzde sessiz kalmayı seçmiştiniz. Bu kararınızın ardından proje yöneticisinin kusurlu fikri uygulamaya kondu. Öngördüğünüz sorunlar gerçekleşti ve proje gecikti. Bazı ekip üyeleri sizin neden uyarmadığınızı merak ediyor.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -10,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 45
            },
            {
                "id": "UNEXPECTED_SUCCESS",
                "text": "Beş gün önce, proje yöneticisinin fikrinin kusurlu olduğunu düşündüğünüzde sessiz kalmayı seçmiştiniz. Endişelerinize rağmen, proje yöneticisinin fikri beklenmedik şekilde başarılı oldu. Belki de eleştirmemekle doğru kararı vermişsiniz.",
                "effects": {
                    "motivation": -5,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 25
            },
            {
                "id": "LOST_OPPORTUNITY",
                "text": "Sessiz kaldığınız için içinizde bir pişmanlık duygusu gelişti. Daha sonra başka biri benzer endişeleri dile getirdi ve takdir topladı.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            }
        ]
    },
    {
        "id": "HELP_COLLEAGUE",
        "text": "Bir iş arkadaşınız çalışmasında zorlanıyor ve sizden yardım istiyor. Yardım eder misiniz?",
        "requirements": {
            "type": "and",
            "conditions": [
                {
                    "resource": "colleagues",
                    "comparison": "gte",
                    "value": 35
                },
                {
                    "resource": "performance",
                    "comparison": "gte",
                    "value": 25
                }
            ]
        },
        "yesEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": 15,
            "boss": 5
        },
        "noEffects": {
            "motivation": 5,
            "performance": 10,
            "colleagues": -10,
            "boss": 0
        },
        "yesText": "Tabi ki yardım ederim",
        "noText": "Şu an çok yoğunum",
        "yesFollowups": [],
        "noFollowups": []
    },
    {
        "id": "TRAINING_COURSE",
        "text": "İş yeriniz mesai saatleri içinde yeni bir beceri öğrenmek için isteğe bağlı bir kurs sunuyor. Katılır mısınız?",
        "yesEffects": {
            "motivation": 5,
            "performance": 15,
            "colleagues": 0,
            "boss": 5
        },
        "noEffects": {
            "motivation": 0,
            "performance": -5,
            "colleagues": 0,
            "boss": -5
        },
        "yesText": "Evet, kaydolayım",
        "noText": "Hayır, işime odaklanmalıyım",
        "maxUses": 2,
        "yesFollowups": [
            {
                "id": "SKILL_ADVANCEMENT",
                "text": "Bir hafta önce, isteğe bağlı eğitim kursuna kaydolmayı seçmiştiniz. Bu kararınız size değerli bir beceri kazandırdı. Bu yeni bilgiyi hemen işinizde uygulamaya başladınız ve verimliliğiniz gözle görülür şekilde arttı.",
                "effects": {
                    "motivation": 15,
                    "performance": 20,
                    "colleagues": 5,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 40
            },
            {
                "id": "NETWORKING_OPPORTUNITY",
                "text": "On gün önce, isteğe bağlı eğitim kursuna kaydolmayı seçmiştiniz. Kurs sırasında farklı departmanlardan insanlarla tanıştınız ve profesyonel ağınızı genişlettiniz. Bu yeni bağlantılar, beklenmedik iş fırsatları yaratmaya başladı.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 30
            },
            {
                "id": "WORK_BACKLOG",
                "text": "Üç gün önce, isteğe bağlı eğitim kursuna kaydolmayı seçmiştiniz. Kurs değerli bilgiler sunsa da, eğitim süresince biriken işleriniz üzerinde baskı yarattı. Şimdi bu gecikmeleri telafi etmek için ekstra çaba harcamanız gerekiyor.",
                "effects": {
                    "motivation": -10,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 20
            },
            {
                "id": "DISAPPOINTING_COURSE",
                "text": "Beş gün önce, isteğe bağlı eğitim kursuna kaydolmayı seçmiştiniz. Ancak eğitim kursu beklentilerinizi karşılamadı. İçerik çok temel düzeydeydi ve zaten bildiğiniz konuları tekrarlıyordu. Zamanınızı daha verimli kullanabilirdiniz.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 10
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_OPPORTUNITY",
                "text": "On iki gün önce, isteğe bağlı eğitim kursuna katılmayıp işinize odaklanmayı seçmiştiniz. Ancak şimdi bu kararınızdan pişmanlık duymaya başladınız. Katılan iş arkadaşlarınız edindikleri yeni becerileri kullanarak öne çıkıyorlar.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 12,
                "probability": 45
            },
            {
                "id": "FOCUSED_PRODUCTIVITY",
                "text": "Beş gün önce, isteğe bağlı eğitim kursuna katılmayıp işinize odaklanmayı seçmiştiniz. Bu kararınız sonuç verdi; önemli bir projeyi zamanında tamamladınız ve yöneticinizin takdirini kazandınız.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 35
            },
            {
                "id": "SELF_LEARNING",
                "text": "İki hafta önce, isteğe bağlı eğitim kursuna katılmayıp işinize odaklanmayı seçmiştiniz. Resmi kursa katılmak yerine, aynı konuyu mesai dışında kendi kendinize öğrenmeye karar verdiniz. Bu kişisel inisiyatif hem becerilerinizi geliştirdi hem de iş-yaşam dengenizi korumanızı sağladı.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 14,
                "probability": 20
            }
        ]
    },
    {
        "id": "SKIP_DAILY_MEETING",
        "text": "Projenizdeki birkaç kişinin ayak üstü toplantı yaptığını duyuyorsunuz. Katılacak mısınız?",
        "yesEffects": {
            "motivation": 0,
            "performance": 0,
            "colleagues": 5,
            "boss": 5
        },
        "noEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": -5,
            "boss": 0
        },
        "yesText": "Evet, katılacağım",
        "noText": "Hayır, katılmayacağım",
        "yesFollowups": [
            {
                "id": "VALUABLE_INFORMATION",
                "text": "Ayak üstü toplantıya katılmanız çok iyi bir karardı. Burada projelerinizi doğrudan etkileyecek önemli bilgiler paylaşıldı ve siz de karar sürecine dahil oldunuz.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 10,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            },
            {
                "id": "TIME_WASTE",
                "text": "Ayaküstü toplantı beklediğinizden uzun sürdü ve çok verimli geçmedi. Konuşulan konuların çoğu sizin görev alanınızla doğrudan ilgili değildi ve değerli zamanınızı aldı.",
                "effects": {
                    "motivation": -10,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            }
        ],
        "noFollowups": [
            {
                "id": "CRITICAL_INFORMATION_MISSED",
                "text": "Toplantıya katılmadığınız için, doğrudan sizi ilgilendiren önemli bir konu hakkında alınan kararları kaçırdınız. Şimdi uyum sağlamak için ekstra çalışmanız gerekiyor.",
                "effects": {
                    "motivation": -10,
                    "performance": -15,
                    "colleagues": -5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 55
            },
            {
                "id": "TASK_COMPLETION",
                "text": "Toplantı yerine mevcut görevinize odaklanarak, önemli bir görevi zamanından önce tamamladınız. Bu verimlilik, kısa vadede işinizin ilerlemesine yardımcı oldu.",
                "effects": {
                    "motivation": 5,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            },
            {
                "id": "PERCEPTION_IMPACT",
                "text": "Toplantıya katılmamanız, bazı ekip üyelerinin sizin takım çalışmasına değer vermediğinizi düşünmesine neden oldu. İletişim eksikliği, gelecekteki işbirliği fırsatlarını etkileyebilir.",
                "effects": {
                    "motivation": 0,
                    "performance": 0,
                    "colleagues": -10,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 10
            }
        ]
    },
    {
        "id": "SPREAD_GOSSIP",
        "text": "Bir iş arkadaşınız hakkında ilginç ama doğrulanmamış bir dedikodu duydunuz. Başkalarına anlatır mısınız?",
        "yesEffects": {
            "motivation": 5,
            "performance": 0,
            "colleagues": -15,
            "boss": -5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 0,
            "colleagues": 5,
            "boss": 5
        },
        "yesText": "Anlatayım gitsin",
        "noText": "Bana saklamalıyım",
        "yesFollowups": [
            {
                "id": "GOSSIP_BACKFIRES",
                "text": "Yaydığınız dedikodunun doğru olmadığı ortaya çıktı ve kaynağının siz olduğu anlaşıldı. İş arkadaşlarınız sizi güvenilmez bulmaya başladı ve profesyonel itibarınız zarar gördü.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": -25,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 60
            },
            {
                "id": "AFFECTED_COLLEAGUE_CONFRONTATION",
                "text": "Hakkında dedikodu yaydığınız iş arkadaşınız bunu öğrendi ve sizinle yüzleşti. Gergin bir konuşma yaşadınız ve aranızdaki ilişki ciddi şekilde zedelendi.",
                "effects": {
                    "motivation": -10,
                    "performance": -10,
                    "colleagues": -20,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 25
            },
            {
                "id": "MANAGEMENT_INTERVENTION",
                "text": "Ofiste yayılan dedikodular yönetimin dikkatini çekti ve iş yerinde profesyonel iletişim hakkında genel bir toplantı düzenlendi. Dedikodu kaynağı olarak doğrudan belirtilmeseniz de, konuyla ilişkilendirildiğinizi hissettiniz.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": -10,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 15
            }
        ],
        "noFollowups": [
            {
                "id": "INTEGRITY_RECOGNIZED",
                "text": "Dedikodu yaymayı reddettiğiniz için, zaman içinde iş arkadaşlarınız arasında dürüst ve güvenilir biri olarak tanındınız. Bu tutumunuz profesyonel itibarınızı olumlu yönde etkiledi.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 45
            },
            {
                "id": "TRUTH_REVEALED",
                "text": "Yaymadığınız dedikodunun tamamen asılsız olduğu ortaya çıktı. Sessiz kalma kararınız sayesinde, potansiyel bir karakter zedelenmesine katkıda bulunmaktan kaçındınız ve kendinizi rahatlamış hissettiniz.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 35
            },
            {
                "id": "COLLEAGUE_GRATITUDE",
                "text": "Hakkında dedikodu yapılan iş arkadaşınız, birçok kişinin bunu yaydığını ancak sizin sessiz kaldığınızı öğrendi. Size olan minnettarlığını ifade etti ve aranızda daha güçlü bir güven bağı oluştu.",
                "effects": {
                    "motivation": 10,
                    "performance": 0,
                    "colleagues": 10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 20
            }
        ]
    },
    {
        "id": "ASK_RAISE",
        "text": "Performansınızın iyi olduğunu düşünüyorsunuz, ama son aldığınız primden memnun değilsiniz. Bu konuyu konuşacak mısınız?",
        "requirements": {
            "type": "and",
            "conditions": [
                {
                    "resource": "performance",
                    "comparison": "gte",
                    "value": 70
                },
                {
                    "resource": "boss",
                    "comparison": "gte",
                    "value": 40
                }
            ]
        },
        "yesEffects": {
            "motivation": 10,
            "performance": 0,
            "colleagues": 0,
            "boss": -5
        },
        "noEffects": {
            "motivation": -10,
            "performance": -5,
            "colleagues": 0,
            "boss": 0
        },
        "yesText": "Evet, zam istiyorum",
        "noText": "Hayır, şimdi sırası değil",
        "yesFollowups": [
            {
                "id": "RAISE_APPROVED",
                "text": "Yöneticiniz performansınızı değerlendirdi ve talebinizi haklı buldu. Bir sonraki dönemde priminizde artış olacağını söyledi.",
                "effects": {
                    "motivation": 20,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 35
            },
            {
                "id": "POSTPONED_DECISION",
                "text": "Yöneticiniz talebinizi dikkate aldığını söyledi ancak şu anda bütçe kısıtlamaları nedeniyle hemen karar veremeyeceğini belirtti. Birkaç ay beklemek zorunda kalacaksınız.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 40
            },
            {
                "id": "REQUEST_REJECTED",
                "text": "Yöneticiniz talebinizi reddetti ve şirketin şu anda prim artışı yapacak durumda olmadığını söyledi. Ayrıca, böyle taleplerin yanlış zamanda yapılmasının uygun olmadığını ima etti.",
                "effects": {
                    "motivation": -15,
                    "performance": -5,
                    "colleagues": 0,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 25
            }
        ],
        "noFollowups": [
            {
                "id": "UNEXPECTED_INCREASE",
                "text": "Siz herhangi bir talepte bulunmamanıza rağmen, yönetiminiz performansınızı takdir etti ve bir sonraki dönemde priminizi artırdı.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 20
            },
            {
                "id": "GROWING_RESENTMENT",
                "text": "Zam konusunu gündeme getirmediğiniz için içinizde bir huzursuzluk büyüyor. Bu durum iş motivasyonunuzu ve performansınızı olumsuz etkilemeye başladı.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 45
            },
            {
                "id": "COLLEAGUE_RAISE",
                "text": "Benzer performansa sahip bir iş arkadaşınızın zam aldığını öğrendiniz. Keşke siz de talepte bulunsaydınız diye düşünüyorsunuz.",
                "effects": {
                    "motivation": -20,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 35
            }
        ]
    },
    {
        "id": "COFFEE_MACHINE_PETITION",
        "text": "Ofisteki kahve makinesi çok eskimiş ve artık hazırladığı kahveler eskisi gibi değil. Yeni bir tane alınması için ilgili birime talep iletir misiniz?",
        "yesEffects": {
            "motivation": 5,
            "performance": 0,
            "colleagues": 10,
            "boss": -5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 0,
            "colleagues": -5,
            "boss": 0
        },
        "yesText": "Evet!",
        "noText": "Hayır, uğraşamam",
        "yesFollowups": [
            {
                "id": "FEEDBACK_POSITIVE",
                "text": "Yeni kahve makinesi geldi! Modern ve kaliteli makine herkesin ofis hayatını iyileştirdi. İş arkadaşlarınız bu girişiminiz için teşekkür ediyor.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 15,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 35
            },
            {
                "id": "FEEDBACK_NEGATIVE",
                "text": "Yeni kahve makinesi talebininize hiçbir yanıt verilmedi. Zaman geçtikçe eski makine daha da kötüleşti ve ofiste bir hayal kırıklığı kaynağı haline geldi.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 30
            },
            {
                "id": "COFFEE_CLUB",
                "text": "Talebiniz sonuç vermedi, ancak siz ve birkaç iş arkadaşınız birleşerek 'kahve kulübü' kurma kararı aldınız. Herkes küçük bir katkı yaparak kaliteli bir makine aldınız ve ofis hayatınız iyileşti.",
                "effects": {
                    "motivation": 20,
                    "performance": 5,
                    "colleagues": 20,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 15,
                "probability": 20
            },
            {
                "id": "BUDGET_CONSTRAINTS",
                "text": "Talebinize olumlu yaklaşılsa da bütçe kısıtlamaları nedeniyle ertelendi. Ancak yönetim sizi dinledi ve bir sonraki çeyrekte bu konuyu ele alacaklarını bildirdiler.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 15
            }
        ],
        "noFollowups": [
            {
                "id": "MACHINE_BREAKDOWN",
                "text": "Kahve makinesi tamamen bozuldu! Artık ofiste kahve içme imkanı kalmadı ve herkes en yakın kafeye gitmek zorunda. Bu durum hem zaman kaybına hem de moral bozukluğuna neden oluyor.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -10,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 8,
                "probability": 40
            },
            {
                "id": "SOMEONE_ELSE_ACTS",
                "text": "Siz harekete geçmediğiniz için başka bir iş arkadaşınız inisiyatif aldı ve yeni bir kahve makinesi talebinde bulundu. Talep kabul edildi ve bu kişi ofiste küçük bir kahraman oldu.",
                "effects": {
                    "motivation": -10,
                    "performance": 0,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 12,
                "probability": 35
            },
            {
                "id": "PERSONAL_SOLUTION",
                "text": "Ofis kahve makinesinden vazgeçip kendi termos kahvenizi getirmeye başladınız. Bu kişisel çözüm size zaman kazandırdı, ancak ekip sosyalleşme anlarından mahrum kaldınız.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": -10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 25
            }
        ]
    },
    {
        "id": "VOLUNTEER_PRESENTATION",
        "text": "Yaklaşan önemli bir toplantıda sunumu kimin yapacağı soruluyor. Gönüllü olur musunuz?",
        "requirements": {
            "type": "and",
            "conditions": [
                {
                    "resource": "performance",
                    "comparison": "gte",
                    "value": 55
                },
                {
                    "resource": "boss",
                    "comparison": "gte",
                    "value": 45
                }
            ]
        },
        "yesEffects": {
            "motivation": -10,
            "performance": 15,
            "colleagues": 5,
            "boss": 15
        },
        "noEffects": {
            "motivation": 5,
            "performance": -5,
            "colleagues": -5,
            "boss": -10
        },
        "yesText": "Ben yapabilirim",
        "noText": "Başkası yapsın",
        "yesFollowups": []
    },
    {
        "id": "WORK_WHILE_SICK",
        "text": "Kendinizi pek iyi hissetmiyorsunuz ama yapacak çok iş var. İşe gitmeli misiniz, yoksa rapor mu almalısınız?",
        "yesEffects": {
            "motivation": -15,
            "performance": -10,
            "colleagues": -10,
            "boss": 10
        },
        "noEffects": {
            "motivation": 10,
            "performance": -15,
            "colleagues": 5,
            "boss": -10
        },
        "yesText": "İşe gideceğim",
        "noText": "Rapor alacağım",
        "yesFollowups": [
            {
                "id": "FEEDBACK_POSITIVE",
                "text": "Çalışma arkadaşlarınız, işinize olan bağlılığınızı takdir etti.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            },
            {
                "id": "FEEDBACK_NEGATIVE",
                "text": "Siz hasta olduktan sonra birkaç kişi daha hastalandı ve hasta vaziyette işe geldiğiniz için bu durumdan sizi sorumlu tuttular.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 50
            }
        ]
    },
    {
        "id": "COLLEAGUE_BIRTHDAY",
        "text": "Bir iş arkadaşınızın doğum günü için ortak hediye alınıyor ve küçük bir kutlama yapılacak. Katılır mısınız?",
        "requirements": {
            "resource": "colleagues",
            "comparison": "gte",
            "value": 25
        },
        "yesEffects": {
            "motivation": 5,
            "performance": -5,
            "colleagues": 15,
            "boss": 0
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": -15,
            "boss": 0
        },
        "yesText": "Evet, katılalım",
        "noText": "Hayır, katılmayacağım",
        "yesFollowups": [
            {
                "id": "STRENGTHENED_RELATIONSHIPS",
                "text": "Doğum günü kutlamasına katılmanız iş arkadaşlarınızla olan ilişkilerinizi güçlendirdi. Samimi bir ortamda yapılan sohbetler ekip dinamiğinizi olumlu etkiledi ve ofiste daha rahat hissetmeye başladınız.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 20,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 60
            },
            {
                "id": "UNEXPECTED_NETWORKING",
                "text": "Kutlamada normalde çok iletişim kurmadığınız bir üst düzey yönetici ile tanışma fırsatı buldunuz. Bu beklenmedik tanışma, gelecekte size fayda sağlayabilecek bir profesyonel bağlantı oluşturdu.",
                "effects": {
                    "motivation": 15,
                    "performance": 0,
                    "colleagues": 10,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            },
            {
                "id": "PRODUCTIVITY_DIP",
                "text": "Doğum günü kutlaması beklenenden uzun sürdü ve geri kalan iş gününüzde odaklanmakta zorlandınız. Acil bir görevinizi tamamlamak için mesai sonrası çalışmak zorunda kaldınız.",
                "effects": {
                    "motivation": -5,
                    "performance": -10,
                    "colleagues": 5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 10
            }
        ],
        "noFollowups": [
            {
                "id": "SOCIAL_ISOLATION",
                "text": "Doğum günü kutlamasına katılmadığınız için, iş arkadaşlarınız arasında dışlanmış hissettiniz. Sonraki günlerde ofiste dolaşan fotoğraflar ve sohbetler sizi biraz yalnız hissettirdi.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 55
            },
            {
                "id": "DEADLINE_ACHIEVEMENT",
                "text": "Kutlamaya katılmak yerine işinize odaklandınız ve yaklaşan bir teslim tarihini sorunsuz bir şekilde tamamladınız. Bu profesyonel başarı size iş doyumu sağladı.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            },
            {
                "id": "AWKWARD_NEXT_DAY",
                "text": "Doğum günü olan iş arkadaşınız ertesi gün neden katılmadığınızı sordu. Açıklamanız inandırıcı gelmedi ve aranızda kısa süreli bir gerginlik oluştu.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": -20,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 10
            }
        ]
    },
    {
        "id": "POSTPONE_VACATION",
        "text": "Tam izne çıkacakken, proje sorumlusu çalışmalarda sizin yardımınıza ihtiyaç duyacaklarını söylüyor. İzninizi erteler misiniz?",
        "requirements": {
            "type": "or",
            "conditions": [
                {
                    "resource": "performance",
                    "comparison": "gte",
                    "value": 75
                },
                {
                    "resource": "boss",
                    "comparison": "gte",
                    "value": 60
                }
            ]
        },
        "yesEffects": {
            "motivation": -25,
            "performance": 15,
            "colleagues": 0,
            "boss": 20
        },
        "noEffects": {
            "motivation": 15,
            "performance": -15,
            "colleagues": 0,
            "boss": -15
        },
        "yesText": "Evet, projeye yardım ederim",
        "noText": "Hayır, izne çıkıyorum",
        "yesFollowups": [
            {
                "id": "FEEDBACK_POSITIVE",
                "text": "İşe bağlılığınız takdir edildi ve proje sorumlusundan teşekkür aldınız.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            },
            {
                "id": "FEEDBACK_NEGATIVE",
                "text": "Bu izne çok ihtiyacınız vardı ve şimdi aşırı yorgun hissediyorsunuz.",
                "effects": {
                    "motivation": -15,
                    "performance": -15,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 50
            }
        ],
        "noFollowups": []
    },
    {
        "id": "REPORT_LEAK",
        "text": "Tuvalatteki sifonlardan biri bozulmuş ve sürekli su akıtıyor. Bakım ekibine haber verir misiniz?",
        "yesEffects": {
            "motivation": 0,
            "performance": 0,
            "colleagues": 5,
            "boss": 5
        },
        "noEffects": {
            "motivation": 0,
            "performance": 0,
            "colleagues": -5,
            "boss": -10
        },
        "yesText": "Evet, bildireyim",
        "noText": "Hayır, başkası fark eder",
        "yesFollowups": [
            {
                "id": "QUICK_REPAIR",
                "text": "Bakım ekibine haber vermeniz sayesinde sorun hızlıca çözüldü. İş arkadaşlarınız sorumlu davranışınızı takdir etti ve yöneticiniz bu proaktif yaklaşımınızı fark etti.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": 10,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 65
            },
            {
                "id": "DELAYED_RESPONSE",
                "text": "Sifondaki sorunu bildirmenize rağmen bakım ekibi günlerce gelmedi. Sızıntı devam etti ve tuvaletlerin durumu herkesin şikayet konusu oldu. Bazı iş arkadaşlarınız süreci sıkı takip etmediğiniz için sizi eleştirdi.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "WORSENING_SITUATION",
                "text": "Tuvaletteki sifonlardan birindeki sızıntı bildirilmediği için günlerce devam etti ve sonunda tuvalet tabanında ciddi bir su birikintisi oluştu. Bir iş arkadaşınız kayıp düştü ve olayı yönetime bildirdi. Herkes sorunun neden daha önce bildirilmediğini sorguluyor.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -15,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 55
            },
            {
                "id": "SOMEONE_ELSE_REPORTED",
                "text": "Beklediğiniz gibi başka biri sifondaki sorunu fark edip bildirdi. Ancak bildirim gecikmeli yapıldığı için, su faturasında beklenmedik bir artış oldu ve yönetim bu konuda tüm çalışanlara bir uyarı e-postası gönderdi.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": -10,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 35
            },
            {
                "id": "WATER_CONSERVATION_INITIATIVE",
                "text": "Tuvaletteki sızıntı olayından sonra, ofiste bir su tasarrufu girişimi başlatıldı. Çalışanlar bu tür sorunları hemen bildirmeleri konusunda eğitildi ve sizde kendinizi bu konuda suçlu hissettiniz.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 10
            }
        ]
    },
    {
        "id": "TEAM_BUILDING_ACTIVITY",
        "text": "Ofisten bir grup hafta sonu halı saha maçı yapmayı planlıyor ve sizi de davet ettiler. Katılacak mısınız?",
        "yesEffects": {
            "motivation": 5,
            "performance": -5,
            "colleagues": 15,
            "boss": 10
        },
        "noEffects": {
            "motivation": 10,
            "performance": 5,
            "colleagues": -10,
            "boss": -5
        },
        "yesText": "Evet, orada olacağım",
        "noText": "Hayır, katılamayacağım",
        "noFollowups": [
            {
                "id": "FEEDBACK_NEGATIVE",
                "text": "Takım arkadaşlarınız katılmamanızı pek hoş karşılamadı ve bir daha sizi davet etmediler.",
                "effects": {
                    "motivation": -5,
                    "performance": 0,
                    "colleagues": -10,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 100
            }
        ]
    },
    {
        "id": "FORGOT_DEADLINE",
        "text": "Eyvah! Bugün teslim etmeniz raporu tamamen unuttunuz!",
        "yesEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": -5,
            "boss": -5
        },
        "noEffects": {
            "motivation": -15,
            "performance": -10,
            "colleagues": 0,
            "boss": -20
        },
        "yesText": "Hemen yapmaya çalışayım!",
        "noText": "Biraz ek süre isteyeceğim",
        "yesFollowups": [
            {
                "id": "FEEDBACK",
                "text": "Raporu son dakikada yetiştirdiniz ve çalışmanız beğenildi!",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            },
            {
                "id": "FEEDBACK",
                "text": "Elinizden geleni yaptınız ama zamanında bitiremediniz ve ek süre istediniz.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            },
            {
                "id": "FEEDBACK",
                "text": "Raporu zor da olsa zamanında teslim ettiniz ama çalışmanız pek beğenilmedi.",
                "effects": {
                    "motivation": -5,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            }
        ],
        "noFollowups": []
    },
    {
        "id": "TAKE_CREDIT",
        "text": "Bir ekip projesinde önemli bir katkı yaptınız ama sunumda adınız geçmedi. Durumu düzeltir misiniz?",
        "requirements": {
            "resource": "performance",
            "comparison": "gte",
            "value": 50
        },
        "yesEffects": {
            "motivation": 10,
            "performance": 0,
            "colleagues": -10,
            "boss": 5
        },
        "noEffects": {
            "motivation": -15,
            "performance": -5,
            "colleagues": 5,
            "boss": -5
        },
        "yesText": "Katkımı belirtmeliyim",
        "noText": "Boş ver, sorun değil",
        "yesFollowups": [
            {
                "id": "RECOGNITION_GRANTED",
                "text": "Katkınızı belirtme girişiminiz olumlu karşılandı. Ekip lideri bir sonraki toplantıda sizin de katkınızı açıkça vurguladı ve çabanız için teşekkür etti.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 45
            },
            {
                "id": "AWKWARD_SITUATION",
                "text": "Katkınızı belirttiğinizde, ekip içinde kısa süreli bir gerginlik oluştu. Bazı iş arkadaşlarınız bunun ekip başarısını bölme girişimi olduğunu düşündü, ancak yöneticiniz haklı olduğunuzu kabul etti.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": -15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            },
            {
                "id": "SELF_PROMOTION_BACKLASH",
                "text": "Katkınızı vurgulamanız bazı iş arkadaşlarınız tarafından kendini ön plana çıkarma çabası olarak yorumlandı. Ofis ortamında sizinle ilgili olumsuz dedikodular dolaşmaya başladı.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -20,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 20
            }
        ],
        "noFollowups": [
            {
                "id": "CONTINUED_OVERSIGHT",
                "text": "Sunum sırasında projeye katkınızı dile getirmemeyi seçmiştiniz. Katkınızı dile getirmediğiniz için, sonraki projelerde de benzer şekilde göz ardı edildiniz. Bu durum içinizde giderek büyüyen bir hayal kırıklığına neden oldu.",
                "effects": {
                    "motivation": -20,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 10,
                "probability": 50
            },
            {
                "id": "COLLEAGUE_ADVOCATE",
                "text": "Siz sessiz kaldınız, ancak bir iş arkadaşınız toplantıda sizin katkınızdan bahsetti. Bu beklenmedik destek sizi gururlandırdı ve ekip içindeki itibarınızı artırdı.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 15,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 30
            },
            {
                "id": "TEAM_PLAYER_REPUTATION",
                "text": "Sunum sırasında projeye katkınızı dile getirmemeyi seçmiştiniz. Katkınızı öne çıkarmak yerine ekip başarısına odaklanmanız, sizin 'takım oyuncusu' olarak görülmenizi sağladı. Bu tutumunuz uzun vadede olumlu bir izlenim yarattı.",
                "effects": {
                    "motivation": 5,
                    "performance": 5,
                    "colleagues": 10,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 20
            }
        ]
    },
    {
        "id": "IT_ISSUE",
        "text": "Bilgisayarınız çok yavaşladı ve işinizi yapmanızı engelliyor. IT birimine haber verir misiniz?",
        "yesEffects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": 0,
            "boss": 5
        },
        "noEffects": {
            "motivation": -10,
            "performance": -15,
            "colleagues": 0,
            "boss": -5
        },
        "yesText": "Evet, IT'ye yazayım",
        "noText": "Hayır, belki düzelir",
        "yesFollowups": [
            {
                "id": "PROMPT_RESOLUTION",
                "text": "IT ekibi hızlı bir şekilde sorununuza yanıt verdi ve bilgisayarınızı kısa sürede tamir etti. Üretkenliğiniz hızla normale döndü.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 0,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 40
            },
            {
                "id": "SYSTEM_UPGRADE",
                "text": "IT ekibi bilgisayarınızdaki sorunu incelerken, sisteminizde kapsamlı bir güncelleme yapılması gerektiğini fark etti. Bu süreç beklenenden uzun sürdü, ancak sonuçta çok daha hızlı bir bilgisayara kavuştunuz.",
                "effects": {
                    "motivation": 15,
                    "performance": 20,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 25
            },
            {
                "id": "DELAYED_RESPONSE",
                "text": "IT ekibinden yanıt almanız uzun zaman aldı. Bilgisayarınız günlerce düzgün çalışmadı ve bu durum iş takviminizi ciddi şekilde aksattı.",
                "effects": {
                    "motivation": -15,
                    "performance": -20,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 35
            }
        ],
        "noFollowups": [
            {
                "id": "WORSENING_ISSUE",
                "text": "Bilgisayar sorununu görmezden geldiğiniz için durum giderek kötüleşti. Sonunda bilgisayarınız tamamen çöktü ve önemli dosyalarınızı kaybettiniz.",
                "effects": {
                    "motivation": -20,
                    "performance": -25,
                    "colleagues": -5,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 4,
                "probability": 60
            },
            {
                "id": "SELF_RESOLUTION",
                "text": "Şaşırtıcı bir şekilde, bilgisayarınızdaki sorun kendiliğinden düzeldi. Yardım istemeden sorunu atlatmanız zaman kazandırdı.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 0,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 20
            },
            {
                "id": "DIY_SOLUTION",
                "text": "Yardım istemek yerine kendi başınıza çözüm aramaya karar verdiniz. İnternetten bulduğunuz bazı ipuçlarını uygulayarak sorunu kendiniz çözdünüz ve bu deneyim teknik bilginizi artırdı.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 5,
                    "boss": 0
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 20
            }
        ]
    },
    {
        "id": "MENTAL_HEALTH_DAY_OFFER",
        "text": "Motivasyonunuzun düşük olduğu fark edildi. Bir gün izin kullanıp dinlenmek ister misiniz?",
        "requirements": {
            "resource": "motivation",
            "comparison": "lt",
            "value": 30
        },
        "yesEffects": {
            "motivation": 10,
            "performance": -10,
            "colleagues": 0,
            "boss": -5
        },
        "noEffects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": 0,
            "boss": 5
        },
        "yesText": "Evet, ihtiyacım var",
        "noText": "Hayır, işe devam!",
        "maxUses": 3,
        "yesFollowups": [
            {
                "id": "REFRESHED_RETURN",
                "text": "İzin gününüzü iyi değerlendirdiniz ve dinlendiniz. İşe döndüğünüzde kendinizi yenilenmiş ve motive hissediyorsunuz, bu da performansınıza olumlu yansıdı.",
                "effects": {
                    "motivation": 20,
                    "performance": 15,
                    "colleagues": 5,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 70
            },
            {
                "id": "WORK_ACCUMULATION",
                "text": "İzin gününüzde dinlenmiş olsanız da, döndüğünüzde birikmiş işlerle karşılaştınız. Yetişmeniz gereken çok şey var ve bu durum sizi biraz strese soktu.",
                "effects": {
                    "motivation": 5,
                    "performance": -10,
                    "colleagues": 0,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 25
            },
            {
                "id": "NEW_PERSPECTIVE",
                "text": "İzin gününüzde uzaklaşmak, işinize yeni bir bakış açısıyla bakmanızı sağladı. Döndüğünüzde, bir süredir üzerinde çalıştığınız soruna yaratıcı bir çözüm buldunuz.",
                "effects": {
                    "motivation": 15,
                    "performance": 20,
                    "colleagues": 10,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 5
            }
        ],
        "noFollowups": [
            {
                "id": "CONTINUED_BURNOUT",
                "text": "İzin almayı reddettiğiniz için tükenmişlik hissiniz devam etti ve bu durum zamanla performansınızı daha da düşürdü. Kendinizi sürekli yorgun ve odaklanmakta zorluk çeker halde buldunuz.",
                "effects": {
                    "motivation": -15,
                    "performance": -15,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 5,
                "probability": 55
            },
            {
                "id": "PUSHING_THROUGH",
                "text": "Zorluklara rağmen işe devam etme kararınız, kişisel dayanıklılığınızı artırdı. Zorlu bir dönemi atlattınız ve bu deneyim sizi daha güçlü kıldı.",
                "effects": {
                    "motivation": 10,
                    "performance": 5,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 7,
                "probability": 30
            },
            {
                "id": "MANAGER_RECOGNITION",
                "text": "Düşük motivasyonunuza rağmen işe devam etme kararlılığınız, yöneticinizin dikkatini çekti. İş etiğinizi takdir etti ve yaklaşan bir projede size daha fazla sorumluluk vermeyi düşünüyor.",
                "effects": {
                    "motivation": 5,
                    "performance": 0,
                    "colleagues": 0,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 3,
                "probability": 15
            }
        ]
    },
    {
        "id": "CHALLENGING_PROJECT_OFFER",
        "text": "Yüksek performansınız göz dolduruyor. Ekibin geleceği için kritik öneme sahip zorlu ve uzun bir projeye liderlik etmeniz teklif edildi, kabul edecek misiniz?",
        "requirements": {
            "type": "and",
            "conditions": [
                {
                    "resource": "performance",
                    "comparison": "gt",
                    "value": 80
                },
                {
                    "resource": "boss",
                    "comparison": "gt",
                    "value": 50
                }
            ]
        },
        "yesEffects": {
            "motivation": -10,
            "performance": 20,
            "colleagues": 5,
            "boss": 15
        },
        "noEffects": {
            "motivation": 5,
            "performance": -5,
            "colleagues": -5,
            "boss": -10
        },
        "yesText": "Meydan okumayı kabul et",
        "noText": "Şu an alamam",
        "maxUses": 1,
        "yesFollowups": [
            {
                "id": "PROJECT_SUCCESS_MAJOR",
                "text": "Liderliğini üstlendiğiniz projei başarıyla tamamlandı! Bu büyük bir kariyer adımı.",
                "effects": {
                    "motivation": 20,
                    "performance": 15,
                    "colleagues": 10,
                    "boss": 25
                },
                "isInfoOnly": true,
                "delay": 20,
                "probability": 70
            },
            {
                "id": "PROJECT_STRESS",
                "text": "Liderliğini üstlendiğiniz proje çok stresliydi ve sizi yıprattı, ancak başarıyla tamamlandı.",
                "effects": {
                    "motivation": -15,
                    "performance": 10,
                    "colleagues": 5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 20,
                "probability": 30
            },
            {
                "id": "PROJECT_STRESS",
                "text": "Liderliğini üstlendiğiniz proje  çok stresli ve yorucu. Buna daha fazla katlanamadınız ve liderliği bıraktınız.",
                "effects": {
                    "motivation": -15,
                    "performance": -15,
                    "colleagues": -15,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 6,
                "probability": 30
            }
        ]
    },
    {
        "id": "TEAM_LUNCH_INVITE",
        "text": "Ekip öğle yemeğine çıkıyor. Onlara katılmak ister misin?",
        "requirements": {
            "resource": "colleagues",
            "comparison": "gt",
            "value": 50
        },
        "yesEffects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 15,
            "boss": 0
        },
        "noEffects": {
            "motivation": -5,
            "performance": 0,
            "colleagues": -10,
            "boss": 0
        },
        "yesText": "Harika fikir!",
        "noText": "Meşgulüm",
        "yesFollowups": [
            {
                "id": "TEAM_BONDING",
                "text": "Ekip yemeğine katılmanız harika bir karar oldu. Çalışma arkadaşlarınızla gayri resmi bir ortamda sohbet etme fırsatı buldunuz ve aranızdaki bağlar güçlendi.",
                "effects": {
                    "motivation": 15,
                    "performance": 5,
                    "colleagues": 20,
                    "boss": 5
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 60
            },
            {
                "id": "PROJECT_INSIGHTS",
                "text": "Öğle yemeğinde iş arkadaşlarınızla sohbet ederken, üzerinde çalıştığınız projeyle ilgili değerli fikirler edindiniz. Bu bilgiler işinizi daha verimli yapmanıza yardımcı olacak.",
                "effects": {
                    "motivation": 10,
                    "performance": 15,
                    "colleagues": 10,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 25
            },
            {
                "id": "LUNCH_EXTENDED",
                "text": "Yemek beklenenden uzun sürdü ve önemli bir toplantıya geç kaldınız. Bu durum performansınızı biraz etkiledi.",
                "effects": {
                    "motivation": -5,
                    "performance": -10,
                    "colleagues": 5,
                    "boss": -10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 15
            }
        ],
        "noFollowups": [
            {
                "id": "MISSED_CONNECTION",
                "text": "Ekip yemeğine katılmamayı seçtiniz ve önemli bir sosyalleşme fırsatını kaçırdınız. İş arkadaşlarınız sizin yokluğunuzu fark etti ve bir sonraki sefer sizi davet etmekte tereddüt edebilirler.",
                "effects": {
                    "motivation": -10,
                    "performance": 0,
                    "colleagues": -15,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 1,
                "probability": 55
            },
            {
                "id": "PRODUCTIVE_SOLITUDE",
                "text": "Ofiste kalıp çalışmaya devam etmeniz, birikmiş işlerinizi halletmenize olanak sağladı. Bu sessiz zaman diliminde normalden daha verimli çalıştınız.",
                "effects": {
                    "motivation": 5,
                    "performance": 15,
                    "colleagues": -5,
                    "boss": 10
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 35
            },
            {
                "id": "IMPORTANT_DISCUSSION",
                "text": "Ekip yemeğinde sizin yokluğunuzda, gelecek projeler hakkında önemli bilgiler konuşuldu. Bu bilgilerin dışında kalmak sizi dezavantajlı bir duruma düşürdü.",
                "effects": {
                    "motivation": -10,
                    "performance": -5,
                    "colleagues": -5,
                    "boss": -5
                },
                "isInfoOnly": true,
                "delay": 2,
                "probability": 10
            }
        ]
    },
    {
        "id": "BOSS_FEEDBACK_SESSION",
        "text": "Grup lideriniz sizinle birebir görüşmek istiyor.",
        "requirements": {
            "type": "or",
            "conditions": [
                {
                    "resource": "boss",
                    "comparison": "gt",
                    "value": 60
                },
                {
                    "resource": "boss",
                    "comparison": "lt",
                    "value": 20
                }
            ]
        },
        "yesEffects": {
            "motivation": 0,
            "performance": 0,
            "colleagues": 0,
            "boss": 0
        },
        "noEffects": {
            "motivation": -5,
            "performance": -5,
            "colleagues": 0,
            "boss": -10
        },
        "yesText": "Toplantıyı kabul et",
        "noText": "Müsait değilim de",
        "maxUses": 3,
        "yesFollowups": [
            {
                "id": "FEEDBACK_POSITIVE",
                "text": "Görüşme iyi geçti! Grup lideriniz performansınızdan memnun.",
                "effects": {
                    "motivation": 15,
                    "performance": 10,
                    "colleagues": 0,
                    "boss": 15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            },
            {
                "id": "FEEDBACK_NEGATIVE",
                "text": "Görüşme zordu. Grup lideriniz bazı endişelerini dile getirdi.",
                "effects": {
                    "motivation": -15,
                    "performance": -10,
                    "colleagues": -5,
                    "boss": -15
                },
                "isInfoOnly": true,
                "delay": 0,
                "probability": 50
            }
        ]
    },
    {
        "id": "INFO_TRAINING_DAY",
        "text": "Bugün ekip içi zorunlu bir eğitim günü. Herkes günün büyük kısmını UME'deki toplantı salonunda geçirecek.",
        "effects": {
            "motivation": -5,
            "performance": 5,
            "colleagues": 5,
            "boss": 0
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_DIGITAL_DETOX",
        "text": "Yönetim 'Dijital Detoks Haftası' başlattı. Toplantılarda telefon ve laptop kullanımı kısıtlandı.",
        "effects": {
            "motivation": -5,
            "performance": 10,
            "colleagues": 0,
            "boss": 5
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_STOCK_UP",
        "text": "Yeni yüksek tutarlı bir proje alındığı öğrenildi. Ofiste genel bir iyimserlik havası var!",
        "effects": {
            "motivation": 10,
            "performance": 5,
            "colleagues": 5,
            "boss": 5
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_STOCK_DOWN",
        "text": "Yakın zamanda yeni proje alınmayacağı ve bunun prim ödemelerini etkileyeceği söylentileri var. Hiçkimse bu durumu pek hoş karşılamadı.",
        "effects": {
            "motivation": -15,
            "performance": -10,
            "colleagues": -5,
            "boss": -5
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_COLLEAGUE_CAKE",
        "text": "Ne güzel bir sürpriz! Bir iş arkadaşınız bugün herkes için ev yapımı elmalı kurabiye getirmiş!",
        "effects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 10,
            "boss": 0
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_QUARTER_END",
        "text": "Performans değerlendirme dönemi yaklaşıyor. Herkes hedefleri tutturmak için yoğun bir baskı altında.",
        "effects": {
            "motivation": -10,
            "performance": 10,
            "colleagues": -5,
            "boss": 10
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_QUARTER_END",
        "text": "Yaptığınız son çalışma sahada çalışmakta olan sistemde problemlere yol açtı. Bu durumu en kısa zamanda düzeltmelisiniz.",
        "effects": {
            "motivation": -10,
            "performance": 10,
            "colleagues": -5,
            "boss": -5
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_FIRE_DRILL",
        "text": "Sürpriz! Yangın tatbikatı zamanı. Herkes binayı boşaltıyor.",
        "effects": {
            "motivation": 0,
            "performance": -5,
            "colleagues": 5,
            "boss": 0
        },
        "isInfoOnly": true,
        "maxUses": 2
    },
    {
        "id": "INFO_HOLIDAY_GOODBYE",
        "text": "Bayram tatili öncesi  toplu bayramlaşma vakti!",
        "effects": {
            "motivation": 0,
            "performance": -5,
            "colleagues": 5,
            "boss": 0
        },
        "isInfoOnly": true,
        "maxUses": 2
    },
    {
        "id": "INFO_HOLIDAY_GOODBYE_2",
        "text": "Bayram öncesi ofiste toplu bayramlaşma sırasında bir arkadaşınız sizinle bayramlaşmaktan kaçındı. Bu durumu pek hoş karşılamadınız.",
        "effects": {
            "motivation": 0,
            "performance": 0,
            "colleagues": -5,
            "boss": 0
        },
        "isInfoOnly": true,
        "maxUses": 2
    },
    {
        "id": "INFO_BONUS_ANNOUNCED",
        "text": "Beklenmedik bir duyuru: Bu çeyrek için ekstra performans primi dağıtılacak!",
        "effects": {
            "motivation": 10,
            "performance": 5,
            "colleagues": 5,
            "boss": 0
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_OFFICE_RENOVATION",
        "text": "Ofis havalandırması arızalandı ve tamir çalışmaları başladı.",
        "effects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": 0,
            "boss": 0
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_OFFICE_RENOVATION",
        "text": "Yeni satın alınan klimaların yerleşimi konusunda sizin görüşünüz alınmamış ve sizi rahatsız eden bir konumda yerleştirilmiş. Bu performansınızı olumsuz etkiliyor.",
        "effects": {
            "motivation": -5,
            "performance": -10,
            "colleagues": 0,
            "boss": 0
        },
        "isInfoOnly": true,
        "maxUses": 1
    },
    {
        "id": "INFO_NEW_MANAGER",
        "text": "Bölümünüze yeni bir yönetici atandı. Herkes bu değişime alışmaya çalışıyor.",
        "effects": {
            "motivation": 0,
            "performance": -5,
            "colleagues": 0,
            "boss": -5
        },
        "isInfoOnly": true,
        "maxUses": 1
    },
    {
        "id": "INFO_CLIENT_PRAISE",
        "text": "Müşteriden övgü dolu bir e-posta geldi. Tüm ekip projede gösterdiği özveri için tebrik edildi.",
        "effects": {
            "motivation": 15,
            "performance": 5,
            "colleagues": 10,
            "boss": 15
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_DEADLINE_EXTENDED",
        "text": "Üzerinde çalıştığınız projenin teslim tarihi dokuz ay uzatıldı. Herkes rahat bir nefes aldı.",
        "effects": {
            "motivation": 10,
            "performance": -10,
            "colleagues": 5,
            "boss": 0
        },
        "isInfoOnly": true
    },
    {
        "id": "INFO_OFFICE_TREATS",
        "text": "Ekip arkadaşlarınızdan biri bugün ofise sürpriz yaparak pasta almış. Yenilen pastalar sayesinde ofiste pozitif bir hava oluştu.",
        "effects": {
            "motivation": 10,
            "performance": -5,
            "colleagues": 15,
            "boss": 5
        },
        "isInfoOnly": true
    }
]